<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap2/sida4/huvudsid4.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:03 GMT -->
<HEAD><META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252"><TITLE>huvudsid4</TITLE><META NAME="Version" CONTENT="8.0.3410"><META NAME="Date" CONTENT="10/11/96"><META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\HTML.DOT"></HEAD><BODY LINK="#0000ff" BGCOLOR="#ffffff"><B><FONT FACE="Arial" SIZE=5><P ALIGN="CENTER">MTF och bildkvalitet</P></B></FONT><FONT FACE="Arial"><P>F&ouml;r att beskriva kvaliteten i en optisk avbildning eller annat optiskt instrument beh&ouml;ver man ett standardiserat m&aring;tt p&aring; uppl&ouml;sning (f&ouml;rm&aring;ga att s&auml;rskilja sm&aring; detaljer) och konstrast (normaliserad intensitetsskillnad mellan m&ouml;rka och ljusa partier.</P><P>Information om b&auml;gge dessa f&aring;r man genom det som kallas MTF (Modulation Transfer Function) vilken &auml;r en funktion av linjet&auml;thet (spatial frekvens), f&ouml;r vilka modulationen m&auml;ts i objekt och bild, varefter kvoten bildas. </P><P>Modulation defineras som <IMG SRC="Image386.gif" WIDTH=102 HEIGHT=46>och f&ouml;r att definera MTF beh&ouml;ver vi objekt med s&aring; bra modulation som m&ouml;jligt. Ofta v&auml;ljer man d&aring; randm&ouml;ster med sinusformigt varierande intensitet. Imin blir d&aring; 0 vilket g&ouml;r att modulationen blir 1. Det &auml;r uppenbart att allteftersom vi byter till objekt med h&ouml;gre och h&ouml;gre spatial frekvens blir skillnaden mellan m&ouml;rker och ljus mindre. N&auml;r vi inte l&auml;ngre ser bilden av objektet &auml;r ju Imax=Imin och modulationen blir 0. Vidare finns det ett direkt samband mellan ett optiskt systems f&ouml;rm&aring;ga att avbilda en skarp kant och h&ouml;g MTF f&ouml;r h&ouml;ga spatialfrekvenser. En skarp kant och ett sinusm&ouml;nster med h&ouml;g frekvens inneh&aring;ller ju b&auml;gge snabba variationer i intensitet. Med fourieranalys kan man sedan (fast vi inte g&ouml;r det) visa att alla bilder kan delas upp i spatialfrekvenser d&auml;r h&ouml;ga frekvenser alltid motsvarar skarpa kanter.</P><P>MTF blir allts&aring; en kurva som b&ouml;rjar p&aring; 1 f&ouml;r l&aring;ga frekvenser och sedan p&aring; olika s&auml;tt sjunker mot noll. Den spatialfrekvens d&auml;r vi kommer ner till modulationen noll brukar kallas uppl&ouml;sningsgr&auml;ns eller p&aring; suver&auml;n svenska cut-off-frekvens.</P><P></FONT><A HREF="bskmtf.html">Testa</A><FONT FACE="Arial"> sj&auml;lv sambandet mellan olika MTF funktioner och f&ouml;rm&aring;gan att avbilda ett svartvitt randm&ouml;nster. Man kan (utan att editera filen) v&auml;lja mellan tre olika former p&aring; MTF-kurva och godtyckligt v&auml;rde p&aring; gr&auml;nsfrekvens (1 motsvarar ett linjepar p&aring; fyra pixlar p&aring; sk&auml;rmen, dvs l&auml;gre v&auml;rde kommer att vara sk&auml;rmbegr&auml;nsat). Gaussisk MTF &auml;r typisk f&ouml;r aberrationer, sinc f&ouml;r felfokusering och rect f&ouml;r diffraktion i koherenta system.</P><P>Vidare kan man ur ett MTF diagram l&auml;sa av fler saker &auml;n h&ouml;gsta uppl&ouml;sbara spatialfrekvens.</P><P>Ett l&aring;gt och konstant v&auml;rde f&ouml;r l&aring;ga frekvenser betyder mycket str&ouml;ljus i systemet. Smuts har ofta denna effekt p&aring; linser. Det inneb&auml;r att kontrasten blir d&aring;lig &auml;ven f&ouml;r grova linjer.</P></FONT></BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap2/sida4/huvudsid4.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:03 GMT -->
</HTML>