<HTML>


<HEAD>
    <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
    <TITLE>huvudsid5</TITLE>
    <META NAME="Version" CONTENT="8.0.3410">
    <META NAME="Date" CONTENT="10/11/96">
    <META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\HTML.DOT">
</HEAD>

<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff"><B>
        <FONT FACE="Arial" SIZE=5>
            <P>Optiska halvledarkomponenter</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>Detta kapitel inleds med en genomg&aring;ng av bandmodellen och dopade halvledare. K&auml;nner man med sig
            att man kan detta b&ouml;r man hoppa direkt till de optiska till&auml;mpningarna.</P><IMG SRC="Image379.gif"
            ALIGN="RIGHT" HSPACE=12 WIDTH=361 HEIGHT=225>
        <P>N&auml;r vi
    </FONT><A HREF="../sida1/huvudsid1.html#skalmodell">
        <FONT FACE="Arial">beskrev</FONT>
    </A>
    <FONT FACE="Arial"> hur ljus och materia v&auml;xelverkade i kapitlet om om lasern anv&auml;nde vi en skalmodell som
        &aring;tminstone n&auml;rmar sig sanningen f&ouml;r hur ljus bildas och f&ouml;rst&ouml;rs i en gas. I ett fast
        &auml;mne &auml;r emellertid situationen en helt annan vilket beror p&aring; n&aring;got som kallas Pauli's
        uteslutningsprincip. Denna g&ouml;r att i ett fast &auml;mne kommer varje energiniv&aring; (=kemisternas skal)
        att delas upp i mycket t&auml;tt liggande niv&aring;er. I princip en niv&aring; f&ouml;r varje atom. Detta
        g&ouml;r att vi f&ouml;r en normal fysisk klump materia ( med kanske 10<SUP>20</SUP> - 10<SUP>30</SUP> atomer)
        kommer att f&aring; energiniv&aring;erna samlade i band ungef&auml;r d&auml;r skalen l&aring;g i de ensamma
        atomerna.. Detta g&auml;ller bara de skal som verkligen kommer i kontakt med varandra, dvs inte de innersta. De
        som &auml;r mest intressanta optiskt &auml;r det yttersta som &auml;r befolkat vid l&aring;g temperatur och det
        innersta som &auml;r i pricip tomt vid l&aring;g temperatur. De band dessa ger upphov till kallas valensband och
        ledningsband. </P>
    </FONT>
    <P><A HREF="egentligen.html">
            <FONT FACE="Arial">F&ouml;rbeh&aring;ll f&ouml;r f&ouml;rfattarens goda samvete</FONT>
        </A>
        <FONT FACE="Arial">.
    </P>
    <P>I en ledare &auml;r valensbandet fullt och ledningsbandet halvfullt vilket leder till att elektroner som befinner
        sig i ledningsbandet kan r&ouml;ra sig utan att beh&ouml;va &auml;ndra energi s&auml;rdeles mycket. Ett yttre
        p&aring;lagt elektriskt f&auml;lt g&ouml;r att vi f&aring;r en potentialbacke i ledningsbandet, som har sin
        lutning s&aring; att elektronerna r&ouml;r sig fr&aring;n plus till minus. (Detta inneb&auml;r att de r&ouml;r
        sig uppf&ouml;r potentialbacken, de &auml;r ju negativa). </P>
    <P>En isolator d&auml;remot har ett fullt valensband och ett tomt eller s&aring; gott som tomt ledningsband.
        &Auml;ven i detta fall kommer ledningbandet att bilda en backe, men tyv&auml;rr finns det inga &aring;kare i
        denna. I valensbandet finns laddningar men dessa kan inte r&ouml;ra sig eftersom det inte finns n&aring;gra
        lediga platser att glida till. Inte heller kan man vid den yttre pluspolen bilda lediga platser (s.k.
        h&aring;l), eftersom de elektroner som ligger d&auml;r skulle beh&ouml;va tillf&ouml;ras energi f&ouml;r att ta
        sig upp till den yttre ledarens ledningband. Den enda elektroner som kan leda str&ouml;m &auml;r det f&aring;tal
        som kan ta sig upp till ledningbandet pga av atomernas v&auml;rmekollisioner eller liknande h&auml;ndelser. Vid
        rumstemperatur &auml;r emellertid avst&aring;ndet mellan underkant p&aring; ledningbandet och &ouml;verkant
        p&aring; valensbandet (=bandgapet) s&aring; stort att antalet som tar sig upp &auml;r f&ouml;rsumbart. Om
        bandgapet &auml;r mindre &auml;r inte materialet en isolator utan en halvledare. Ett annat s&auml;tt att
        f&aring; materialet ledandet &auml;r att l&auml;gga p&aring; en stor sp&auml;nning att den &auml;r
        tillr&auml;cklig f&ouml;r att dra elektronerna upp ur isolatorns valensband. Popul&auml;rt kallat &ouml;verslag
        och inte s&aring; trevligt.</P>
    <P>Bandgapets storlek &auml;r ocks&aring; direkt relaterat till materialets optiska egenskaper. den
        v&aring;gl&auml;ngd som enligt </FONT>
        <FONT FACE="Symbol">l</FONT>
        <FONT FACE="Arial">=c/f motsvarar bandgapets energi &auml;r en gr&auml;ns mellan de v&aring;gl&auml;ngder som
            transmitteras genom materialet (l&auml;ngre) och de som absorberas (kortare). Vanligt glas har allts&aring;
            ett bandgap som motsvarar, vilken v&aring;gl&auml;ngd? </FONT><A HREF="glasbandgap.html">
            <FONT FACE="Arial">&gt;!!&lt;</FONT>
        </A>
    </P>
    <FONT FACE="Arial">
        <P>En halvledare &auml;r egentligen bara ett specialfall av en isolator
    </FONT><I>
        <FONT FACE="Arial" SIZE=2 COLOR="#ff0000">(och allts&aring; inte av en ledare fast det l&aring;ter s&aring;)
    </I></FONT>
    <FONT FACE="Arial">n&auml;mligen</FONT>
    <FONT FACE="Arial" SIZE=4> </FONT>
    <FONT FACE="Arial">med bandgap som &auml;r s&aring; litet att elektroner redan vid rumstemperatur i
        n&auml;mnv&auml;rd utstr&auml;ckning (vad nu det &auml;r?) tagit sig upp i ledningsbandet pga v&auml;rme. I
        praktiken inneb&auml;r detta en bandgap vars motsvarande v&aring;gl&auml;ngd ligger i IR, vilket vi behandlar
    </FONT><A HREF="../../kap5/sida1/huvudsid1.html">
        <FONT FACE="Arial">senare</FONT>
    </A>
    <FONT FACE="Arial" SIZE=4>.</P>
    </FONT>
    <FONT FACE="Arial">
        <P>Nu &auml;r det bara det att de halvledare som f&ouml;rekommer i optiska sammanhang &auml;r inte rena utan
            dopade, vilket naturligtvis har sina konsekvenser.</P>
        <P>Dopning f&ouml;rekommer av tv&aring; typer: p-dopning och n-dopning. Inneb&ouml;rden f&ouml;rklaras
            l&auml;ttast med ett exempel:</P>
    </FONT>
    <FONT FACE="Arial" SIZE=5 COLOR="#800080">
        <P>N-dopning</P><IMG SRC="Image380.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=293 HEIGHT=324>
    </FONT>
    <FONT FACE="Arial">
        <P>Inneb&auml;r att &auml;mnet i fr&aring;ga &auml;r uppblandat med (i mycket sm&aring; koncentrationer) ett
            &auml;mne med fler elektroner i sitt yttersta skal &auml;n v&auml;rdmaterialet. Exempel &auml;r kisel dopat
            med fosfor. En snabb titt p&aring; periodiska systemet avsl&ouml;jar att kisel (Si) har 4 elektroner i sitt
            yttersta skal, medan fosfor (P) har fem. Eftersom fosforatomerna nu &auml;r s&aring; mycket f&auml;rre
            (dopning m&auml;ts i ppm) kommer materialets elektronstruktur att best&auml;mmas av kisel, dvs den
            bandstruktur vi har &auml;r i princip kisels. Dock m&aring;ste de stackars elektroner som h&auml;rstammar
            fr&aring;n fosforatomerna vara n&aring;gonstans. Dessa kommer i allm&auml;nnhet att bilda en extraniv&aring;
            strax under ledningsbandet. "Platserna" i denna niv&aring; &auml;r lokaliserade till de respektive
            fosforatomernas n&auml;rhet, vilket inneb&auml;r att de elektoner som befinner sig d&auml;r innte kan flytta
            sig utan att ta sig upp till ledningandet. (Dopatomerna ligger s&aring; l&aring;ngt ifr&aring;n varandra att
            deras elektronmoln inte &ouml;verlappar). Denna nytillkomna niv&aring; brukar kallas donatorniv&aring;.
            Eftersom avst&aring;ndet mellan denna och ledningsbandet &auml;r relativt litet kommer en stor del av
            donatorelektronerna att befinna sig ledningsbandet pga v&auml;rme redan vid rumstemperatur. Materialet leder
            allts&aring; str&ouml;m tack vare n&auml;rvaron av (NNNNegativa) eletroner i ledningbandet. D&auml;rav
            namnet.</P>
        <P>Bara en viktig kontrollfr&aring;ga: Vilken laddning kommer en klump av N-dopat material att f&aring; (plus,
            minus eller neutralt)?
    </FONT><A HREF="Ndopladdn.html"><IMG SRC="Image381.gif" BORDER=0 WIDTH=248 HEIGHT=43></A></P>
    <FONT FACE="Arial" SIZE=5 COLOR="#00ff00">
        <P>P-dopat</P><IMG SRC="Image382.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=293 HEIGHT=324>
    </FONT>
    <FONT FACE="Arial">
        <P>Sedan kan man g&ouml;ra det l&auml;tt f&ouml;r sig genom att s&auml;ga att p-dopat &auml;r tv&auml;rt om, men
            det &auml;r nog inte hela sanningen. Ett exmpel p&aring; p-dopat material &auml;r aluminium dop&auml;mne i
            kisel som v&auml;rdmaterial. Aluminium har tre elektroner i sitt yttersta skal vilket inneb&auml;r att varje
            Al-atom har "plats" f&ouml;r en extra elektron. Dessa platser (som allts&aring; fr&aring;n b&ouml;rjan
            &auml;r tomma) kommer att bilda en niv&aring; som ligger strax &ouml;ver valensbandet och kallas
            acceptorniv&aring;. P&aring; samma s&auml;tt som elektroner inte kan flytta sig i donatorniv&aring;n i
            n-dopade halvledare kan de inte flytta sig h&auml;r heller. Pga av det lilla energiavst&aring;ndet mellan
            valensband och acceptorniv&aring; kommer en stor del av acceptorplatserna att fyllas av elektroner
            fr&aring;n valensbandet. Dessa kan som sagt inte r&ouml;ra sig, men d&auml;remot kan de lediga platser som
            uppkommer i valensbandet flytta sig. Dessa upptr&auml;der d&aring; som om de vore PPPPositiva laddningar och
            kallas h&aring;l. </P>
    </FONT>
    <FONT FACE="Arial" COLOR="#000080">
        <P>(Egentligen &auml;r det naturligtvis &auml;ven i detta fall elektroner som r&ouml;r sig, men i st&auml;llet
            f&ouml;r att f&ouml;rs&ouml;ka beskriva den kaskadprocess som uppst&aring;r d&aring; en r&ouml;rlig plats
            flyttar sig genom en massa elektrooner beskriver vi r&ouml;relsen av ett h&aring;l.)</P>
    </FONT>
    <FONT FACE="Arial">
        <P>Inte heller ti detta fal &auml;r materialet laddat utan den elektron som fattas i varje aluminiumatom
            motsvaras av en positiv laddning mindre i k&auml;rnan.</P>
    </FONT>
    <FONT FACE="Arial" SIZE=4>
        <P>Mobilitet</P>
    </FONT>
    <FONT FACE="Arial">
        <P>H&aring;l och elektroner brukar kallas laddningsb&auml;rare. Dessa har olika r&ouml;rlighet i olika
            situationer. H&auml;r ska vi bara konstatera att elektroner inte kan r&ouml;ra sig alls i p-dopat material,
            eftersom de d&auml;r bara faller ner i existerande h&aring;l och g&ouml;r materialet negativt (!!!) laddat,
            vilket st&ouml;ter bort ytterligare elektroner. Inte heller kan h&aring;l r&ouml;ra sig i n-dopat material
            eftersom de omedelbart fylls av elektroner fr&aring;n donatorniv&aring;n och blir positivt laddade, vilket i
            sin tur st&ouml;ter bort ytterligare h&aring;l.</P>
        <P>Det riktigt intressanta intr&auml;ffar nu om vi l&aring;ter p- och n-dopat material komma in kontakt med
            varandra, dvs den s&aring; kallade PN-&ouml;verg&aring;ngen.</P><IMG SRC="Image383.gif" ALIGN="RIGHT"
            HSPACE=12 WIDTH=552 HEIGHT=252>
        <P>I kontaktytan mellan p och ndopat material kommer elektroner fr&aring;n den ndopade sidan att vinna energi
            p&aring; att falla ner i h&aring;l p&aring; den p-dopade. Detta kommer att h&ouml;ja den potentiella energin
            f&ouml;r elektroner p&aring; den p-dopade sidan (som nu blir negativt laddad) och s&auml;nka den f&ouml;r
            den n-dopade. Detta ger oss in i sj&auml;lva &ouml;verg&aring;ngen inbyggd potentialskillnad som &auml;r
            ansvarig f&ouml;r m&aring;nga av de egenskaper den har.</P>
    </FONT>
    <FONT FACE="Arial" SIZE=5>
        <P>Lysdioden</P>
    </FONT>
    <FONT FACE="Arial">
        <P>I en lysdiod &auml;r den p-dopade sidan ansluten till yttre plus och tv&auml;rt om. Detta medf&ouml;r
            elektroner injiceras i det n-dopade materialet och h&aring;l i det p-dopade. det yttre f&auml;ltet drar nu
            b&auml;gge mot &ouml;verg&aring;ngen och vi noterar att de befinner sig i den materialtyp d&auml;r de kan
            r&ouml;ra sig bra. N&auml;r de kommer fram till gr&auml;nsen rekombinerar de, dvs elektroner fr&aring;n n
            trillar ner i h&aring;len fr&aring;n p. De vinner energi p&aring; att g&ouml;ra det (trots vad som sas ovan
            d&auml;rf&ouml;r att (H&aring;ll tungar r&auml;tt i mun nu!): N-sidan som &auml;r ansluten till minus
            sjunker i potential, dvs stiger i potentiell energi f&ouml;r elektroner (potential &auml;r potentiell energi
            per positiv laddning). P&aring; P-sidan blir det tv&auml;rtom dvs banden sjunker. N&auml;r nu elektroner och
            h&aring;l rekombinerar frig&ouml;rs energi, som kan komma i form av ljus. Om ingetting speciellt gjort
            f&ouml;r att f&ouml;rhindra detta kommer ljuset snabbt att &aring;terabsorberar och vi observerar ingenting
            annat utifr&aring;n. Om vi d&auml;remot givit fotonerna en flyktv&auml;g, genom att skapa en s&aring;dan
            geometri kommer vi att kunna observera ljuset. Ett exempel p&aring; s&aring;dan geometri utg&ouml;rs av
            lysdioden.</P>
        <P>Till
    </FONT><A HREF="../../inledning/index.html">
        <FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT>
    </A></P>
    <FONT FACE="Arial">
        <P>Till
    </FONT><A HREF="../../kap4/sida1/huvudsid1.html">
        <FONT FACE="Arial">n&auml;sta kapitel</FONT>
    </A>
    <FONT FACE="Arial"> (v&aring;goptik)</P>
    </FONT>
</BODY>


</HTML>