<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap1/sida5/Huvudsid5.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:45 GMT -->
<HEAD><META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252"><TITLE>Kikaren och teleskopet</TITLE><META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\HTML.DOT"></HEAD><BODY LINK="#0000ff" VLINK="#800080"><B><FONT FACE="Arial" SIZE=4><P>Kikaren och teleskopet</P></B></FONT><FONT FACE="Arial"><P>Fr&aring;gar man ett barn vad en kikare &auml;r kommer ho/an ofelbart att s&auml;ga att det &auml;r n&aring;gonting som g&ouml;r att det som ligger l&aring;ngt bort kommer n&auml;rmre. Ur barnamun kommer emellertid inte alltid sanningen. Kikare och teleskop &auml;ndrar n&auml;mligen (oftast) inte alls p&aring; avst&aring;ndet utan &ouml;kar bara den </FONT><A HREF="../sida3/huvudsid3.html#synvinkel"><FONT FACE="Arial">synvinkel</FONT></A><FONT FACE="Arial"> man har mellan tv&aring; objekt (eller som ett objekt upptar)</P></FONT><B><FONT FACE="Arial" SIZE=4><P ALIGN="JUSTIFY">Ett objekt rakt fram</P></B></FONT><FONT FACE="Arial"><P>Vi bygger ett teleskop med 3 ggr f&ouml;rstoring (kundkretsen blir s&auml;kert inte s&aring; stor, men det blir tydligare figurer &auml;n med 10ggr f&ouml;rstoring)</P><P>Id&eacute;n &auml;r att anv&auml;nda en svag lins f&ouml;rst (objektiv) och en starkare en bit d&auml;refter (okular=eng. eyepiece). De ska placeras p&aring; ett avst&aring;nd som &auml;r summan av deras fokall&auml;ngder. Vi v&auml;ljer i v&aring;rt exempel 60mm, 20mm och allts&aring; avst&aring;nd 80mm.</P><P>Om vi tittar p&aring; str&aring;lar som kommer in rakt framifr&aring;n, kommer de d&aring; att brytas ihop till den gemensamma </FONT><A HREF="../sida3/huvudsid3.html#fokall&auml;ngd"><FONT FACE="Arial">fokalpunkten</FONT></A><FONT FACE="Arial">. D&auml;rfr&aring;n in mot okularet beter de sig som gr&ouml;na str&aring;lar (vi byter inte f&auml;rg i fig) och g&aring;r sedan ut parallellt med symmetriaxeln</P></FONT><P><IMG SRC="Image64.gif" WIDTH=552 HEIGHT=207></P><FONT FACE="Arial"><P>B&aring;de objekt och bild ligger allts&aring; i o&auml;ndligheten. Den enda slutsats vi kan dra s&aring; h&auml;r l&aring;ngt &auml;r att str&aring;larna ligger t&auml;tare dvs att vi koncentrerat ljuset.</P></FONT><P><A HREF="ljuskonc.html"><FONT FACE="Arial">Hur mycket mer ljus f&aring;r man in i &ouml;gat fr&aring;n en given stj&auml;rna med "teleskop" &auml;n utan</FONT></A><FONT FACE="Arial">?</P></FONT><B><FONT FACE="Arial" SIZE=4><P>Tv&aring; objekt i vinkel</P></B></FONT><FONT FACE="Arial"><P>F&ouml;r att begripa detta med vinkelf&ouml;rstoringen tillgriper vi en r&ouml;d stj&auml;rna bel&auml;gen lite off-axis ocks&aring;. Alla str&aring;lar fr&aring;n den &auml;r parallella med varandra och samlas allts&aring; i fokalplanet (dvs p&aring; fokall&auml;ngds avst&aring;nd fr&aring;n objektivet), men inte i fokus. De g&aring;r igenom denna punkt som kommer att bli mellanbild dvs fungera som objekt till okularet. Eftersom mellanbilden ligger i okularets fokalplan kommer alla str&aring;lar fr&aring;n den att &aring;nyo bli parallella efter okularet. Vilken deras gemensamma riktning blir kan vi ta reda p&aring; genom att rita en hj&auml;lpstr&aring;le fr&aring;n mellanbilden genom mitten p&aring; okularet (g&aring;r ju rakt igenom d&auml;r).</P></FONT><P><IMG SRC="Image65.gif" WIDTH=552 HEIGHT=207></P><FONT FACE="Arial"><P>Vi ser nu med &ouml;gonm&aring;tt att vinkeln mellan stj&auml;rna r&ouml;d och stj&auml;rna bl&aring; &ouml;kat tack vara kikaren.</P><P>Men om vi r&auml;knar?</P><P>Om a &auml;r synvinkel utan kikare och b synvinkel med kikare, och alla vinklar &auml;r sm&aring;, s&aring; g&auml;ller</P></FONT><P><IMG SRC="Image66.gif" WIDTH=366 HEIGHT=24></P><FONT FACE="Arial"><P>Ju st&ouml;rre kvot mellan fokall&auml;ngderna ju st&ouml;rre f&ouml;rstoring allts&aring;.</P><P>Ett litet problem har emellertid dykt upp:</P><P>Stj&auml;rna r&ouml;d l&aring;g ju upp&aring;t!</P><P>Efter instrumentet ser de ut att komma nerifr&aring;n!</P><P>Bilden &auml;r allts&aring; upp och ner.</P><P>F&ouml;r att v&auml;nda r&auml;tt den finns flera r&auml;ttv&auml;ndningssystem </FONT><A HREF="erectsys.html"><FONT FACE="Arial">(beskrivning i niv&aring; 3)</FONT></A><FONT FACE="Arial"> byggande p&aring; prismor eller speglar.</P><P>Till </FONT><A HREF="../../kap2/sida1/huvudsid1.html"><FONT FACE="Arial">n&auml;sta kapitel</FONT></A><FONT FACE="Arial"> (Begr&auml;nsningar i optiska system)</P><P>Till </FONT><A HREF="../../inledning/index.html"><FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT></A></P><B><FONT FACE="Arial" SIZE=4><P ALIGN="JUSTIFY">Ljushantering i kikare (Niv&aring; 2)</P></B></FONT><FONT FACE="Arial"><P>Om vi inf&ouml;r lite mer realism i figurerna inser vi att en stark lins (okularet) inte kan g&ouml;ras hur stor som helst (fokall&auml;ngd=diameter brukar vara en gr&auml;ns).</P><P>Vi ritar om figuren med samma linser , men med givna diametrar. Objektivet f&aring;r diametern 40mm och okularet 20mm. </P><P>S&aring; ritar vi in ljus fr&aring;n fyra stj&auml;rnor (bl&aring;, gr&ouml;n, r&ouml;d och brun, i stigande vinkel). Alla stj&auml;rnor ger mellanbilder i det gemensamma fokus, men hur mycket ljus fr&aring;n var och en g&aring;r igenom okularet?</P></FONT><P><IMG SRC="Image67.gif" WIDTH=549 HEIGHT=413></P><FONT FACE="Arial"><P>Vi ser att bl&aring; och gr&ouml;n stj&auml;rna tar sig igenom helt och h&aring;llet. </P><P>Vad g&auml;ller stj&auml;rna r&ouml;d kommer h&auml;lften av str&aring;larna (de som ligger i &ouml;vre halvan av objektivet) att hamna utanf&ouml;r okularet. Symtomet p&aring; detta &auml;r att den syns ljussvagare &auml;n den borde. Fenomenet kallas vinjettering och fr&aring;nvaror av s&aring;dan (dvs att synf&auml;ltet blir m&ouml;rkare ut &aring;t kanten) brukar anses som ett kvalitetsm&aring;tt p&aring; optik. P&aring; grund av &ouml;gats f&ouml;rl&aring;tande egenskaper brukar man anse att det &auml;r acceptabelt med vinjettering upp till den situation som beskrivs i fig, dvs h&auml;lften f&ouml;rsvinner l&auml;ngst ut. F&ouml;r att hindra ytterligare f&ouml;rs&auml;mring blockerar man helt enkelt det som ligger l&auml;ngre ut genom att placera en bricka med lagom stort h&aring;l i det gemensamma fokalplanet.</P><P>Stj&auml;rna brun (hur nu den ser ut??) ligger helt utanf&ouml;r synf&auml;ltet.</P><P>Ett annat s&auml;tt att l&ouml;sa problemet &auml;r att anv&auml;nda ett flerlinsigt system d&auml;r Huygens okular (liknar modernare Ramsden och Erfl, men &auml;r mycket enklare att beskriva) f&aring;r tj&auml;na som exempel. </P><P>Innan vi ger oss i kast med detta ska vi titta p&aring; ytterligare en sak:</P><P>Var b&ouml;r &ouml;gat placeras i f&ouml;rh&aring;llande till okularet?</P><P>Inte alldeles intill i vart fall! D&auml;r kommer en liten m&auml;nniskopupill (dagsljus t.ex.) att g&ouml;ra s&aring; att inga r&ouml;da str&aring;lar alls kommer in i &ouml;gat. </P><P>I det plan d&auml;r f&auml;lten b&auml;st &ouml;verlappar varandra ligger det vi kallar <A NAME="exitpup">uttr&auml;despupillen</A> (exit pupil). Denna utg&ouml;r bilden av den ljusbegr&auml;nsande &ouml;ppningen (=aperturen, i detta fall &auml;r objektivet apertur) i riktning mot bildrymden.</P><P>I v&aring;rt exempel hamnar den 26.7mm till h&ouml;ger om okularet och &auml;r 13mm i diameter. Allm&auml;nnt blir dess diameter objektivdiametern / f&ouml;rstoringen (h&auml;rledning ing&aring;r ej).</P><P>&nbsp;</P><P>Den b&ouml;r vara ungef&auml;r lika stor som &ouml;gats pupill vid nattseende om man inte ska sl&ouml;sa med ljus. Emellertid kan vi konstatera att 26.7mm &auml;r f&ouml;r mycket! Ingen vill h&aring;lla sin kikare p&aring; s&aring; stort avst&aring;nd (om den inte &auml;r ett kikarsikte, d&aring; man vill ha lite marginal f&ouml;r vapnets rekyl. Det &auml;r s&aring; sm&auml;rtsamt annars) &Auml;ven detta problem (och ett till som beskriv i n&auml;sta kapitel) l&ouml;ses av Huygens okular</P></FONT><B><FONT FACE="Arial" SIZE=4><P>Kikare med Huygens okular</P></B></FONT><FONT FACE="Arial"><P>Vi p&aring;minner f&ouml;rst om </FONT><A HREF="../sida4/Huygens.html"><FONT FACE="Arial">Huygens okular</FONT></A><FONT FACE="Arial"> som best&aring;r av tv&aring; linser med lika fokall&auml;ngd placerade p&aring; fokall&auml;ngds avst&aring;nd fr&aring;n varandra. Huvudplanen l&aring;g d&aring; omlott och avst&aring;nden mellan FF och BF var bara lika med f<SUB>syst</P></SUB><P>Om vi s&auml;tter in ett s&aring;dan i ett teleskop kommer str&aring;larna att se ut som i fig.</P></FONT><P><IMG SRC="Image68.gif" WIDTH=552 HEIGHT=183></P><FONT FACE="Arial"><P>Eftersom FF ligger i den f&ouml;rsta linsen i okularet, ska denna (den f&ouml;rsta linsen) placeras i fokus till objektivet, dvs i v&aring;rt fall 60mm efter objektivet. Bl&aring; str&aring;lar p&aring;verkas inte alls av denna, medan de str&aring;lar som kommer fr&aring;n stj&auml;rna r&ouml;d kommer att b&ouml;jas av in mot symmetriaxeln. (Konstruktionen av dessa &auml;r lite kn&ouml;lig och ing&aring;r inte i kursen) Efter den andra linsen kommer de att vara inb&ouml;rdes parallella (som v&auml;ntat). Den viktigaste skillnaden gentemot ett enlinsigt okular &auml;r att de r&ouml;da str&aring;larna sk&auml;r de bl&aring; n&aring;gra mm efter sista okularlinsen (jfr med 26.7mm efter i enlinsfallet). Uttr&auml;despupillen kommer allts&aring; att ligga mycket b&auml;ttre till.</P><P>R&auml;kna sj&auml;lv ut var den ligger och hur stor den &auml;r om objektivet &auml;r 40mm i diameter. </FONT><A HREF="exitpup.html"><FONT FACE="Arial">L&ouml;sning</FONT></A><FONT FACE="Arial">!</P><P>Vidare finns det en f&ouml;rdel som har med synf&auml;ltets utkanter att g&ouml;ra och en nackdel som har med sj&auml;lva linsens glasyta att g&ouml;ra.</P></FONT><P><A HREF="posneg.html">@</A></P><FONT FACE="Arial"><P>Till </FONT><A HREF="../sida6/huvudsid6.html"><FONT FACE="Arial">n&auml;sta sida</FONT></A><FONT FACE="Arial"> (Mikroskopet)</P><P>Till </FONT><A HREF="../../kap2/sida1/huvudsid1.html"><FONT FACE="Arial">n&auml;sta kapitel</FONT></A><FONT FACE="Arial"> (Begr&auml;nsningar i optiska system)</P><P>Till </FONT><A HREF="../../inledning/index.html"><FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT></A></P></BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap1/sida5/Huvudsid5.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:45 GMT -->
</HTML>