<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap3/sida1/huvudsid1.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:03 GMT -->
<HEAD><META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252"><TITLE>huvudsid1</TITLE><META NAME="Version" CONTENT="8.0.3410"><META NAME="Date" CONTENT="10/11/96"><META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\HTML.DOT"></HEAD><BODY LINK="#0000ff" VLINK="#800080"><B><FONT FACE="Arial" SIZE=6><P>Kap 3 Laser och Laserteknik</P></FONT><FONT FACE="Arial" SIZE=5><P>Lasern bakgrund </P></B></FONT><FONT FACE="Arial"><P>Laserljus skiljer sig fr&aring;n annat ljus i ett antal avseenden:</P><OL><LI>Det &auml;r h&ouml;ggradigt parallellt. Divergensen i str&aring;len ligger f&ouml;r en bra laser p&aring; mellan 0.2 och 1 mrad. Om str&aring;len f&ouml;rbereds med en s&aring; kallad beam expander (svensk allm&auml;ngiltig &ouml;vers&auml;ttning saknas) kan divergensen nedbringas till storleksordning 0.01mrad. denna egenskap &auml;r viktig f&ouml;r alla pekartill&auml;mpningar, avst&aring;ndsm&auml;tning &ouml;ver stora avst&aring;nd och vid deposition av stora energim&auml;ngder p&aring; liten yta (l&auml;s: f&ouml;rst&ouml;relse)</LI><LI>Det &auml;r mycket v&auml;ldefinierat i v&aring;gl&auml;ngd. Spridningen ligger p&aring; 0.01 - 0.2nm eller mellan 1:100000 till 1:5000. Denna egenskap &auml;r (f&ouml;rutom i vetenskapliga sammanhang) viktig f&ouml;r f&ouml;rb&auml;ttra signal/brusf&ouml;rh&aring;llandet i m&auml;tningar d&auml;r mycket annat ljus finns samtidigt (ute t.ex.), genom att man kan g&ouml;ra detektorn k&auml;nslig enbart f&ouml;r den v&aring;gl&auml;ngden</LI><LI>Ljuset best&aring;r av en sammanh&auml;ngade v&aring;g i st&auml;llet f&ouml;r flera oberoende. Detta &auml;r viktigt vid s&aring; kallad interferometri, dvs d&aring; m&auml;tningar av st&aring;nd ska ske med ljusv&aring;gl&auml;ngs noggrannhet, men i de flesta praktiska m&auml;tsituationer inte s&aring; viktigt.</LI><LI>Ljuspulserna kan g&ouml;ras mycket korta (storleksordning pikosekunder, ps) vilket &auml;r viktigt f&ouml;r god uppl&ouml;sning i en del typer av avst&aring;ndsm&auml;tning och n&auml;r det g&auml;ller att deponera tillr&auml;ckliga energim&auml;ngder innan n&aring;got skyddssystem hunnit verka</LI></OL></FONT><B><FONT FACE="Arial" COLOR="#ff0000"><P>D&auml;remot</B></FONT><FONT FACE="Arial"> &auml;r ljuset inte speciellt energirikt. Ett par j&auml;mf&ouml;relser: Solen ger vid ekvatorn ca 1300W/m² i effekt. En pulsad YAG-laser (Beskrivs p&aring; sid2 detta kapitel) ger p&aring; 100m avst&aring;nd ungef&auml;r lika mycket i medeleffekt. Tittar man d&auml;remot p&aring; maxeffekt momentant under pulsen f&aring;r man ett 100000ggr h&ouml;gre v&auml;rde. Men den allra st&ouml;rsta skillnaden &auml;r parallelliteten som bl a g&ouml;r str&aring;len s&aring; farlig f&ouml;r &ouml;gonen eftersom &ouml;gats lins har ett </FONT><A HREF="../../kap1/sida3/huvudsid3.html#fokall&auml;ngd"><FONT FACE="Arial">fokus</FONT></A><FONT FACE="Arial"> p&aring; n&auml;thinnan vilket g&ouml;r str&aring;len fokuseras d&auml;r. Den belysta fl&auml;cken d&auml;r </FONT><A HREF="../../kap2/sida2/huvudsid2.html#diffeye"><FONT FACE="Arial">blir</FONT></A><FONT FACE="Arial"> ngt tiotal µm². Ljus fr&aring;n 10mm² fokuseras allts&aring; till 10µm² dvs till en miljondel s&aring; stor yta. D&aring; blir ocks&aring; effekten per yta (kallas ofta intensiteten) 1.000.000 ggr h&ouml;gre &auml;n vid pupillen.</P><P>I alla lasertill&auml;mpningar b&ouml;r man vara p&aring; det klara med vilken av dessa egenskaper man vill anv&auml;nda. &Auml;r det inte helt klart, finns det s&auml;kert billigare och (f&ouml;r &ouml;gat) ofarligare ljusk&auml;llor att v&auml;lja.</P></FONT><B><FONT FACE="Arial" SIZE=5><P>Fysikalisk bakgrund och str&aring;legenskaper (niv&aring;2)</P></B></FONT><FONT FACE="Arial"><P>F&ouml;r att f&ouml;rst&aring; laserns verkningss&auml;tt &auml;r en barnslig liknelse bra att b&ouml;rja med: </P><P>Anslut en h&ouml;gtalare till en f&ouml;rst&auml;rkare och p&aring; ing&aring;ngssidan av f&ouml;rst&auml;rkaren en mikrofon. L&aring;t f&ouml;rst&auml;rkaren f&ouml;rst&auml;rka 10000ggr (totalt fr&aring;n mik till h&ouml;gtalare). Om man d&aring; n&auml;rmar sig h&ouml;gtalaren med mikrofonen vet man (?) att man vid ett givet avst&aring;nd kommer ett obehagligt tjut att starta i h&ouml;gtalaren. Detta &auml;r <A NAME="rundg">rundg&aring;ng</A> eller oscillation, vilket har sin orsak i att mikrofonen plockar upp mer &auml;n 1/10000-del, s&auml;g som exempel 1/8000-del. Vilket ljud som helst (eller bara brus) kommer d&aring; att f&ouml;rst&auml;rkas 1.25 ggr. Ljudet v&auml;xer allts&aring; kontinuerligt i styrka. Detta forts&auml;tter naturligtvis inte hur l&auml;nge som helst utan s&aring; sm&aring;ningom planar ljudstyrkan ut och vi f&aring;r en konstant niv&aring;. Vad har </FONT><A HREF="jmvgain.html"><FONT FACE="Arial">h&auml;nt</FONT></A><FONT FACE="Arial"> d&aring;?</P><P><MARQUEE SCROLLDELAY="36" SCROLLAMOUNT="2" WIDTH="99" >Vid konstant ljudnivå är alltså alltid återkoppling x förstärkning = 1!</MARQUEE> </P><P>F&ouml;r att nu g&ouml;ra samma sak med ljus beh&ouml;ver vi allts&aring; tv&aring; saker:</P><OL><LI>En ljusf&ouml;rst&auml;rkare (som f&ouml;rst&auml;rker en given ljusstr&aring;le)</LI><LI>En &aring;terkopplinsmekanism</LI></OL><P>Vi b&ouml;rjar med ljusf&ouml;rst&auml;rkningen: </P><IMG SRC="Image103.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=390 HEIGHT=269> <P>Det finns fem s&auml;tt ljus kan v&auml;xelverka med materia. Vi tittar p&aring; en atom med tv&aring; intressanta energiniv&aring;er (det kemil&auml;rare brukar kalla skal). Med intressanta menas att det finns skal n&auml;ra k&auml;rnan som inte deltar i ljusalstringsprocesser, och skal l&auml;ngs ut som &auml;r tomma och d&auml;rf&ouml;r inte heller deltar. Vi vill befinna oss i gr&auml;nslandet d&auml;remellan. Det yttersta skalet som &auml;r besatt kallar vi niv&aring; 1, och det innersta som &auml;r tomt kallar vi 2 (3 kommer sedan utanf&ouml;r). Det &auml;r n&auml;r elektronerna flyttas mellan dessa niv&aring;er som ljus alstras eller absorberas. Skillnaden i energi mellan skalen avg&ouml;r vilka ljusv&aring;gl&auml;ngder som kan delta i processerna.</P></FONT><P><IMG SRC="Image104.gif" WIDTH=549 HEIGHT=233></P><FONT FACE="Arial"><P>Absorption &auml;r n&auml;r ljus med r&auml;tt v&aring;gl&auml;ngd kommer i tillr&auml;cklig n&auml;rhet av en atom (molekyl). Ljusets energi anv&auml;nds till att lyfta elektronen till den &ouml;vre niv&aring;n. D&auml;rmed &auml;r den ljuspartikelns (fotonens) saga all och energin finns lagrad i atomen. D&auml;r kan den antingen ge upphov till v&auml;rme n&auml;r den ramlar ner igen eller ge upphov till emission. Sannolikheten (S) f&ouml;r att detta ska ske beror av; ljusintensiteten (I), antal atomer med elektronen i den undre niv&aring;n (N<SUB>1</SUB>) och en f&ouml;r oss ointressant atomfysikalisk storhet B <IMG SRC="Image105.gif" WIDTH=65 HEIGHT=22></P><P>Spontan emission intr&auml;ffar n&auml;r elektronen av en eller annan anledning (kollision med annan atom pga v&auml;rme eller absorption) tagit sig upp till den niv&aring; 2. D&auml;ruppe v&auml;ntar den en tid (varierar mellan 1ns och flera sekunder), men n&auml;r den tiden g&aring;tt &ouml;kat sannolikheten f&ouml;r att den ska ramla ner. N&auml;r den g&ouml;r det utl&ouml;ses den lagrade energin som ljus. Detta sker vid en slumpm&auml;ssig tidpunkt och i slumpm&auml;ssig riktning. Sannolikheten ges av S=N<SUB>1</SUB>A d&auml;r A &auml;r en ny atomfysikalisk storhet</P><P>Men (!!!) om ljus av r&auml;tt v&aring;gl&auml;ngd passerar atomen under den tid elektronen ligger i den &ouml;vre niv&aring;n (dvs innan den ramlat) kommer den att utl&ouml;sa ett fall f&ouml;r elektronen. Det ljus som d&aring; uts&auml;nds kommer att ligga helt i fas med samt ha samma riktning och v&aring;gl&auml;ngd som det f&ouml;rbipasserande ljuset som orsakade h&auml;ndelsen. Detta kallas <A NAME="stimemis"><B>Stimulerad emission</A></B>. Dvs detta &auml;r en f&ouml;rst&auml;rkningsprocess. Sannolikheten f&ouml;r den ges av <IMG SRC="Image106.gif" WIDTH=66 HEIGHT=22>, dvs den skiljer sig fr&aring;n absorption bara genom att det &auml;r antalet atomer i den &ouml;vre niv&aring;n som r&auml;knas.</P><P>Den fj&auml;rde processen inneb&auml;r att ljus av <B>fel </B>v&aring;gl&auml;ngd passerar. Ljus och atom utf&ouml;r en handskakningsprocess f&ouml;r att se om de passar f&ouml;r varandra. Detta tar ngn femtosekund. N&auml;r de uppt&auml;cker att de inte g&ouml;r det forts&auml;tter ljuset som om ingenting h&auml;nt. Vad kallas </FONT><A HREF="vv4.html"><FONT FACE="Arial">detta</FONT></A><FONT FACE="Arial"> fenomen och har vi anv&auml;nt det </FONT><A HREF="../../kap1/sida1/Brytningslagen-2.html"><FONT FACE="Arial">tidigare</FONT></A><FONT FACE="Arial">?</P><P>Det sista fenomenet anv&auml;nder tre niv&aring;er. Ljus som passar i v&aring;gl&auml;ngd till avst&aring;nder mellan niv&aring;1 och niv&aring;3 absorberas och lyfter elektronen till niv&aring; 3, varifr&aring;n den efter en kortare tid faller till niv&aring; 2. N&auml;r detta sker s&auml;nds infrar&ouml;tt ljus, vilket oftast absorberas och blir till v&auml;rme i materialet. Fr&aring;n niv&aring; 2 faller elektronen sedan med spontan eller stimulerad emission (beroende p&aring; vad som sker f&ouml;rst) till niv&aring; 1. H&auml;rvid uts&auml;nds ljus med mindre energi (= kortare v&aring;gl&auml;ngd) &auml;n det ursprunliga. Fenomenet kallas fluorescens och anv&auml;nds praktiskt i m&aring;nga sammanhang, exempelvis i optiskt vitmedel i tv&auml;ttmedel och som signalf&auml;rg p&aring; regn/arbetsrockar. </P><P>Nu har vi allts&aring; v&aring;r f&ouml;rst&auml;rkningsprocess: Stimulerad emission. Det g&auml;ller bara att f&aring; den att &ouml;verv&auml;ga &ouml;ver absorptionen. Tyv&auml;rr har naturen behagat obstruera och i alla naturliga situationer (oberoende av temperatur etc) &auml;r alltid N<SUB>1</SUB>&gt;N<SUB>2</SUB> vilket leder till att absorption &ouml;verv&auml;ger. </P><P>Kan man nu lysa p&aring; materialet med lampljus vid r&auml;tt v&aring;gl&auml;ngd? Nej! Det leder visserligen till att blir fler elektroner i niv&aring; 2, men ju mer lika de blir i antal desto mer n&auml;rmar sig sannolikheterna f&ouml;r absorption och stimulerad emission varandra. N&auml;r dessa blivit lika har ljuset ingen effekt l&auml;ngre ty d&aring; &auml;r N<SUB>1</SUB>=N<SUB>2</SUB> och materialet har blivit genomskinligt!!!! Men man tager vad man haver och vi kan ju alltid prova ett system med ytterligare en niv&aring;.</P><P>Om vi tar ett 3-niv&aring;system (rubin som exempel) och belyser (=pumpar) med ljus som passar f&ouml;r absorption 1</FONT><FONT FACE="Wingdings">&egrave;</FONT><FONT FACE="Arial"> 3 (gr&ouml;nt) kommer elektronerna att ta sig dit. Om nu "medelv&auml;ntetiden" (spontana livstiden heter det egentligen) &auml;r kort kommer de snabbt att falla ner till niv&aring; 2, d&auml;r medelv&auml;ntetiden i rubin &auml;r l&aring;ng (det var bl a d&auml;rf&ouml;r den f&ouml;rsta lasern som byggdes var av rubin). Om den gr&ouml;na lampan lyser tillr&auml;ckligt starkt kommer elektronerna att stockas i niv&aring; 2 (vilket &auml;r vad vi vill). Nu har man inte l&auml;ngre n&aring;got N<SUB>1</SUB>=N<SUB>2</SUB>-problem eftersom vi pumpar till en annan niv&aring; &auml;n den vi vill samla elektroner p&aring;. Vi kan allts&aring; i 3-niv&aring;-systemet f&aring; en inverterad population om vi har fler elektroner "ute i r&ouml;relse" &auml;n vad vi har kvar p&aring; niv&aring; (dit de tr&auml;ngtar av naturen). Detta st&auml;ller stora krav p&aring; pumplampornas intensitet och g&ouml;r att em 3-nivlaser blir av "allt eller inget" typ. Om den lasrar s&aring; lasrar den s&aring; kraftigt att materialet inte klarar av att transportera bort den v&auml;rme som alstras. Inte heller finns det lampor som kan f&ouml;rs&ouml;rja mewd tillr&auml;ckligt mycket pumpljus under l&auml;ngre tid. 3-niv&aring;-lasrar &auml;r d&auml;rf&ouml;r i allm&auml;nnhet pulsade och dessutom t&auml;mligen instabila pga av de stora kraven p&aring; pumpning.</P><IMG SRC="Image107.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=282 HEIGHT=151> <P>En l&ouml;sning p&aring; detta problem &auml;r att anv&auml;nda 4-niv&aring;-system, dvs ett system d&auml;r den undre laserniv&aring;n <B>inte</B> &auml;r den yttersta befolkade, utan den innersta tomma. Det inneb&auml;r att endast en liten del av elektronerna beh&ouml;ver var exciterade, dvs ha flyttats fr&aring;n sin naturliga position (som i detta fall &auml;r niv&aring; 0).</P><P>Lasrar av denna typ kan g&ouml;ras kontinuerliga och i princip med hur l&aring;g effekt som helst. De flesta moderna lasrar &auml;r 4-niv&aring;lasrar.</P></FONT><H3>Nu har vi klarat av det ena problemet n&auml;mligen att g&ouml;ra en f&ouml;rst&auml;rkare!!!</H3><H3>N&auml;sta &auml;r att &aring;stadkomma en &aring;terkoppling!</H3><FONT FACE="Arial"><P>Detta &auml;r ett mycket enklare problem. Tv&aring; speglar med reflektansen 1, ger n&auml;mligen en 100% &aring;terkoppling. V&auml;ljer vi ist&auml;llet att l&aring;ta en av dess speglar ha reflektans p&aring; s&auml;g, 0.8 (och allts&aring; transmittans 0.2) </FONT><A HREF="#rundg"><FONT FACE="Arial">inneb&auml;r detta</FONT></A><FONT FACE="Arial"> att vi f&aring;r rundg&aring;ng eller oscillation om v&aring;rt lasermaterial, med adekvat pumpning, ger en f&ouml;rst&auml;rkning st&ouml;rre &auml;n 1.25. </P></FONT><P><IMG SRC="Image108.gif" WIDTH=402 HEIGHT=154></P><FONT FACE="Arial"><P>N&auml;r lasern b&ouml;rjar <A NAME="pumpning">pumpas </A></FONT><FONT FACE="Arial" COLOR="#00ff00">(pumplampor gr&ouml;na i fig ovan)</FONT><FONT FACE="Arial"> kommer d&aring; ljus att skapas med spontan emission </FONT><FONT FACE="Arial" COLOR="#ff0000">(r&ouml;tt streckat)</FONT><FONT FACE="Arial"> &aring;t alla h&aring;ll fr&aring;n laserstaven. F&ouml;r eller senare kommer n&aring;gon av dessa slumpm&auml;ssiga str&aring;lar att r&auml;tt riktning s&aring; att den kan studsa fram och tillbaka mellan speglarna. Denna riktning (och ingen annan) kommer d&aring; att uppleva rundg&aring;ng och en str&aring;le </FONT><B><FONT FACE="Arial" COLOR="#ff0000">(r&ouml;d fet linje)</B></FONT><FONT FACE="Arial"> v&auml;xer upp mellan speglarna som hela tiden v&auml;xer i energi med en faktor som ges av produkten av f&ouml;rst&auml;rkningen och &aring;terkopplingen varje rundtripp. </P><P>S&aring; sm&aring;ningom blir intensiteten mellan speglarna s&aring; stor att f&ouml;rst&auml;rkningen sjunker till 1/&aring;terkopplingen, och vi har d&aring; f&aring;tt en stabil situation. Varje rundtripp tappas 20% av ljuset av (med v&aring;ra siffror), vilket ers&auml;tts med energi fr&aring;n den stimulerade emissionen, som. De 20% &auml;r allts&aring; det som &auml;r v&aring;r laserstr&aring;le </FONT><FONT FACE="Arial" COLOR="#ff0000">(r&ouml;d tunn linje)</FONT><FONT FACE="Arial">!</P><P>I den obehaglige verkligheten ser det inte riktigt ut s&aring; h&auml;r </P><P>Bakspegeln (den v&auml;nstra) &auml;r kr&ouml;kt</P><P>En filterbricka m&aring;ste till f&ouml;r rensa str&aring;len</P><P>Tidsm&auml;ssig kontroll av str&aring;len m&aring;ste inf&ouml;ras med olika metoder.</P><P>Om detta handlar n&auml;sta sida</P><P>Till </FONT><A HREF="../sida2/huvudsid2.html"><FONT FACE="Arial">n&auml;sta sida</FONT></A><FONT FACE="Arial"> (Str&aring;legenskaper)</P><P>Till </FONT><A HREF="../../kap4/sida1/huvudsid1.html"><FONT FACE="Arial">n&auml;sta kapitel</FONT></A><FONT FACE="Arial"> (V&aring;goptik)</P><P>Till </FONT><A HREF="../../inledning/index.html"><FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT></A></P></BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap3/sida1/huvudsid1.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:06 GMT -->
</HTML>