<HTML>
<HEAD>
    <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
    <TITLE>Huvudplansbegreppet</TITLE>
    <META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080"><B>
        <FONT FACE="Arial" SIZE=5>
            <P ALIGN="CENTER">Huvudplansbegreppet (niv&aring; 2)</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>De formler och rittekniker vi hittills tagit fram f&ouml;r tunna linser &auml;r egentligen bara en
            approxiation. F&ouml;r att beskriva tjockare linser och framf&ouml;r allt linssystem som objektiv till
            kameror eller CCD'er skulle vi egentligen beh&ouml;va r&auml;kna p&aring; vad som h&auml;nder i varje yta
            f&ouml;r sig. Det skulle i exvis en TVkamera-lins bli ett trettiotal ytor!</P>
        <P>Det finns ett koncept som g&ouml;r att man tar sig runt n&auml;stan alla dessa sv&aring;righeter. Konceptet
            kallas huvudplan, och &auml;r en metod att hitta tv&aring; plan fr&aring;n vilka man kan r&auml;kna objekts-
            och bild-avst&aring;nd s&aring; att
    </FONT><A HREF="../sida3/huvudsid3.html#linsformeln">
        <FONT FACE="Arial">linsformeln</FONT>
    </A>
    <FONT FACE="Arial"> och alla dess konstruktionsregler kan anv&auml;ndas direkt.</P>
        <P>Strategin i detta avsnitt &auml;r att: </P>
        <P>B&ouml;rja med att ta definiera huvudplan och d&auml;refter</P>
        <P>Visa hur man kan konstruera fram var de ligger i n&aring;gra praktiska fall, och sist</P>
        <P>Visa hur man anv&auml;nder dem praktiskt:</P>
    </FONT><B>
        <FONT FACE="Arial" SIZE=4>
            <P ALIGN="JUSTIFY">Definition</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>Bakre fokalplanet (BF) ligger d&auml;r bilden av ett avl&auml;gset objekt hamnar, dvs d&auml;r str&aring;lar
            parallella med symmetriaxeln bryts ihop mot denna. Det plan d&auml;r dessa str&aring;lar skulle &auml;ndra
            riktning om de bara gjorde det en g&aring;ng kallas bakre huvudplan. Avst&aring;ndet mellan BF och BH kallas
            systemets fokall&auml;ngd, f<SUB>syst</P></SUB>
        <P>Fr&auml;mre huvudplan (FH) och fr&auml;mre fokalplan definieras p&aring; samma s&auml;tt fast f&ouml;r ett
            objekt som ligger o&auml;ndligt l&aring;ng bort fast p&aring; "fel" sida om linsen (dvs i det som vanligen
            &auml;r
    </FONT><A HREF="../sida1/huvudsid1.html#bildrymden">
        <FONT FACE="Arial">bildrymd</FONT>
    </A>
    <FONT FACE="Arial">)</P>
        <P>Praktiskt hittar man huvudplanen genom att skicka en str&aring;le parallellt med symmetriaxeln och sedan
            notera hur den kommer ut.</P>
    </FONT>
    <P><IMG SRC="Image56.gif" WIDTH=486 HEIGHT=187></P>
    <FONT FACE="Arial">
        <P>D&auml;r str&aring;len sk&auml;r symmetriaxeln ligger BF.</P>
        <P>D&auml;refter f&ouml;rl&auml;nger man den inkommande och den utg&aring;ende str&aring;len s&aring; att de
            m&ouml;ts. I m&ouml;tespunkten ligger BH</P>
    </FONT>
    <P><IMG SRC="Image57.gif" WIDTH=486 HEIGHT=216></P>
    <FONT FACE="Arial">
        <P>Avst&aring;ndet mellan BH och BF blir nu systemets fokall&auml;ngd</P>
        <P>Slutligen g&ouml;r man samma sak fr&aring;n andra h&aring;llet
    </FONT>
    <FONT FACE="Arial" COLOR="#008000">(gr&ouml;na str&aring;lar)</FONT>
    <FONT FACE="Arial"> och hittar p&aring; s&aring; s&auml;tt FH och FF. Avst&aring;ndet mellan dem &auml;r alltid det
        samma som mellan BH och BF dvs f<SUB>syst</SUB>. Vilket &auml;r lite kn&ouml;ligt att bevisa s&aring; det
        g&ouml;r vi inte.</P>
    </FONT>
    <P><IMG SRC="Image58.gif" WIDTH=486 HEIGHT=227></P><B>
        <FONT FACE="Arial" SIZE=4>
            <P ALIGN="JUSTIFY">Konstruktion av huvudplan</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>G&ouml;r vi l&auml;ttast genom att g&ouml;ra ett exempel. Vi v&auml;ljer d&aring; ett teleobjektiv, dvs ett
            objektiv som ska ge en st&ouml;rre bild av ett avl&auml;gset objekt &auml;n vad ett normalobjektiv g&ouml;r.
        </P>
        <P>Det &auml;r allts&aring; inte fr&aring;gan om att det vi tittar p&aring; ska komma "n&auml;rmre". Bilden ska
            hamna p&aring; den fotografiska filmen (eller detektorarrayen) med b&auml;gge objektiven!!!</P>
        <P>T&auml;nk nu efter:</P>
        <P>Ska teleobjektivet i s&aring; fall vara
    </FONT><A HREF="../sida2/Huvudsid2.html#linsmakarformeln">
        <FONT FACE="Arial">starkar</FONT>
    </A>
    <FONT FACE="Arial">e eller svagare &auml;n normalobjektivet?</P>
    </FONT>
    <P><A HREF="svagare.html">(!)</A></P>
    <FONT FACE="Arial">
        <P>Vi vill nu g&ouml;ra ett objektiv med fokall&auml;ngden 100 som helst ska vara s&aring; kort som
            m&ouml;jligt.</P>
        <P>Tag en lins med fokall&auml;ngd 50mm och 40mm d&auml;refter en med fokall&auml;ngd -20mm. Studera hur en
            str&aring;le parallell med symmetriaxeln nu g&aring;r igenom systemet.</P>
        <P>I den f&ouml;rsta linsen bryts den ner mot dennas fokus (10mm efter n&auml;sta lins) Denna punkt blir nu
            mellanbild och ska fungera som objekt till n&auml;sta lins (med objektsavst&aring;nd -10mm, <B>obs </B>
    </FONT><A HREF="../sida2/Huvudsid2.html#teckenkonventionen">
        <FONT FACE="Arial">tecknet</FONT>
    </A>
    <FONT FACE="Arial">) Linsformlen f&ouml;r lins 2 ger nu</P>
    </FONT>
    <P><IMG SRC="Image54.gif" WIDTH=250 HEIGHT=41></P>
    <FONT FACE="Arial">
        <P>dvs slutbilden hamnar 20mm efter sista linsen.</P>
        <P>D&auml;r ligger tydligen bakre fokalplanet (BF)</P>
        <P>Drag nu str&aring;len fr&aring;n sista linsen till slutbilden. F&ouml;rl&auml;nger vi denna och den
            utg&aring;ende str&aring;len ser vi att de sk&auml;r varandra l&aring;ngt f&ouml;re f&ouml;rsta linsen, dvs
            d&auml;r ligger BH!!!</P>
    </FONT>
    <P><IMG SRC="Image59.gif" WIDTH=550 HEIGHT=230></P>
    <FONT FACE="Arial">
        <P>Fokall&auml;ngden kan r&auml;knas ut mha likformiga trianglar (uttryck H/h f&ouml;rs med hj&auml;lp av de
    </FONT>
    <FONT FACE="Arial" COLOR="#008000">gr&ouml;nmarkerade </FONT>
    <FONT FACE="Arial">trianglarna och d&auml;refter mha de </FONT>
    <FONT FACE="Arial" COLOR="#ff0000">r&ouml;dmarkerade</FONT>
    <FONT FACE="Arial">, och s&auml;tt sedan lika) till att bli 100mm. Allt medan systemet bara &auml;r 60mm
        l&aring;ngt. </P>
    </FONT><B>
        <FONT FACE="Arial" SIZE=4>
            <P>Anv&auml;ndning</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>Det fina med huvudplan &auml;r att eftersom de str&aring;lar som anv&auml;nts f&ouml;r att definiera BF och
            BH ser ut precis som de bl&aring; str&aring;larna vid konstruktion i tunn lins, och de gr&ouml;na precis som
            de som definierar FF och FH kan vi anv&auml;nda dessa str&aring;lar f&ouml;r att konstruera. Eftersom de
            bl&aring; byter riktning i BH och de gr&ouml;na i FH fungerar alla konstruktionsregler om str&aring;lar
            fr&aring;n objektet slutar i FH och str&aring;lar till bilden b&ouml;rjar i BH.</P>
    </FONT>
    <P><IMG SRC="Image60.gif" WIDTH=547 HEIGHT=163></P>
    <FONT FACE="Comic Sans MS" COLOR="#ff0000">
        <P>Barnsligt uttryckt:</P>
        <P>Ta en sax, klipp is&auml;r pappret utefter BH och FH. Sl&auml;ng bort remsan d&auml;remellan (gr&aring; i fig
            ovan). Tejpa ihop. Nu ser alla str&aring;lar ut som i tunn linsfallet. &Auml;ven den r&ouml;da (det sista
            har vi inte visat utan ni f&aring;r tro p&aring;'t &auml;nd&aring;)</P>
    </FONT>
    <FONT FACE="Arial">
        <P>Eftersom alla konstruktionsregler g&auml;ller g&auml;ller ocks&aring; sj&auml;lva linsformeln f&ouml;r hela
            systemet, om bara a r&auml;knas fr&aring;n objekt till FH och b fr&aring;n BH till bild.</P><B>
            <P>&Ouml;vningsexempel</P>
        </B>
        <P>Objektsavst&aring;nd = 45mm. Konstruera fram bildl&auml;get</P>
    </FONT>
    <P><IMG SRC="Image61.gif" WIDTH=547 HEIGHT=156></P>
    <FONT FACE="Arial">
        <P>S&aring;
    </FONT><A HREF="konstrex1.html">
        <FONT FACE="Arial">h&auml;r</FONT>
    </A>
    <FONT FACE="Arial"> blev det n&auml;r jag f&ouml;rs&ouml;kte.</P>
        <P>Ett annat exempel som vi ska anv&auml;nda i kikarkapitlet &auml;r det s.k. Huygens okular som best&aring;r av
            tv&aring; linser med samma fokall&auml;ngd; s&auml;g 20mm placerade med fokall&auml;ngds lucka.</P>
        <P>Var hamnar alla planen i det fallet och hur stor blir systemets fokall&auml;ngd?</P>
    </FONT>
    <P><A HREF="Huygens.html">
            <FONT FACE="Arial">Svaret</FONT>
        </A>
        <FONT FACE="Arial"> &auml;r lite &ouml;verraskande.
    </P>
    <P>Till </FONT><A HREF="../sida5/Huvudsid5-2.html">
            <FONT FACE="Arial">n&auml;sta sida</FONT>
        </A>
        <FONT FACE="Arial"> (Kikaren och teleskopet)
    </P>
    <P>Till </FONT><A HREF="../../kap2/sida1/huvudsid1.html">
            <FONT FACE="Arial">n&auml;sta kapitel</FONT>
        </A>
        <FONT FACE="Arial"> (Begr&auml;nsningar i optiska system)
    </P>
    <P>Till </FONT><A HREF="../../inledning/index.html">
            <FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT>
        </A></P>
</BODY>
</HTML>