<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap1/sida3/huvudsid3.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:41:41 GMT -->
<HEAD><META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252"><TITLE>Avbildning i tunn lins</TITLE><META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\html.dot"></HEAD><BODY LINK="#0000ff" VLINK="#800080"><B><FONT FACE="Arial" SIZE=5><P ALIGN="CENTER">Avbildning i tunn lins</P></B></FONT><FONT FACE="Arial"><P>Om vi anv&auml;nder </FONT><A HREF="../sida2/Huvudsid2.html#linsmakarformeln"><FONT FACE="Arial">linsmakarformeln</FONT></A><FONT FACE="Arial"> tv&aring; g&aring;nger p&aring; tv&aring; ytor med f&ouml;rsumbart avst&aring;nd emellan </FONT><A HREF="tunnlins.html"><FONT FACE="Arial">f&aring;r vi</FONT></A><FONT FACE="Arial"> <A NAME="linsformeln">linsformeln</A></P></FONT><P><IMG SRC="Image41.gif" WIDTH=125 HEIGHT=41><FONT FACE="Arial">d&auml;r P &auml;r styrkan (i dioptrier) f&ouml;r resp yta</P><P>I denna &auml;r a och b objekts och bildavst&aring;nd och lyder samma teckenkonvention som s och s' i linsmakarformeln.</P><P>Vi definierar nu <A NAME="fokallängd">fokall&auml;ngd</A> (eller br&auml;nnvidd) som bildavst&aring;nd d&aring; objektsavst&aring;ndet &auml;r o&auml;ndligt f&aring;r vi </P></FONT><P><IMG SRC="Image42.gif" WIDTH=142 HEIGHT=45></P><FONT FACE="Arial"><P>Dvs parallella str&aring;lar bryts samman p&aring; fokall&auml;ngds avst&aring;nd fr&aring;n linsen.</P><P>Med utg&aring;ngspunkt fr&aring;n linsformeln kan man formulera ett antal </P><B><P><A NAME="strålkonstruktionsregler">str&aring;lkonstruktionsregler</A> </P></B><P>som vi ska anv&auml;nda oss av fram&ouml;ver.</P><P>Vi beh&ouml;ver tre str&aring;ltyper(egentligen beh&ouml;vs bara tv&aring;, men ibland blir en av typerna av olika sk&auml;l lite &aring;b&auml;kig att anv&auml;nda och d&aring; &auml;r det bra att ha en i reserv)</FONT><FONT FACE="Arial" COLOR="#ff0000"> </P></FONT><FONT FACE="Arial" COLOR="#000080"><P>Typ 1 (ritas med bl&aring; f&auml;rg) &auml;r parallel med symmetriaxeln in mot linsen och bryts f&ouml;ljaktligen s&aring; att den sk&auml;r symmetriaxeln p&aring; fokall&auml;ngds avst&aring;nd (dvs i fokus).</P></FONT><FONT FACE="Arial" COLOR="#008000"><P>Typ 2 (gr&ouml;n) &auml;r omv&auml;ndningen till typ 1 och g&aring;r allts&aring; genom fokus p&aring; v&auml;g in mot linsen. D&auml;r bryts den s&aring; att den blir parallell med symmetriaxeln</P></FONT><FONT FACE="Arial" COLOR="#ff0000"><P>Typ 3 (r&ouml;d) g&aring;r genom linsens mittpunkt. D&auml;r &auml;r linsens b&auml;gge ytor parallella vilket inneb&auml;r att str&aring;len inte &auml;ndrar riktning utan forts&auml;tter rakt fram. (Annars skulle inte vindrutor vara till&aring;tna i bilar, eller hur?)</P></FONT><P><IMG SRC="Image43.gif" WIDTH=521 HEIGHT=195></P><FONT FACE="Arial"><P>Dessa definitioner g&auml;ller &auml;ven f&ouml;r negativa linser, men det praktiska resultatet bli annorlunda eftersom exvis fokus f&ouml;r de inkommande str&aring;larna ligger i objektsrymden. Jfr fig</P></FONT><P><IMG SRC="Image44.gif" WIDTH=526 HEIGHT=228></P><B><FONT FACE="Arial" SIZE=4><P ALIGN="JUSTIFY">Exempel p&aring; konstruktion i tunn positiv lins</P></B></FONT><FONT FACE="Arial"><P>Tag en lins med fokall&auml;ngd 20mm och placera ett objekt 40mm fr&aring;n den.</P><P>Objekt ritas i denna fantasifulla vetenskap som en pil, med bas p&aring; symmetriaxeln.</P><P>Av alla str&aring;lar som g&aring;r ut fr&aring;n pilspetsen v&auml;ljer vi de som &auml;r av typ 1, 2 eller 3, f&ouml;ljer dem genom linsen och ser var de g&aring;r ihop eller ser ut att g&aring; ihop. D&auml;r ligger bilden enligt v&aring;r </FONT><A HREF="../sida1/huvudsid1.html"><FONT FACE="Arial">definition</FONT></A><FONT FACE="Arial"> i kap 1</P></FONT><P><IMG SRC="Image45.gif" WIDTH=524 HEIGHT=209></P><FONT FACE="Arial"><P>Kolla genom att s&auml;tta in a=40mm och f= 20mm i linsformeln att det vi konstruerat fram ser OK ut.</P><P>Rita d&auml;refter sj&auml;lv hur det blir vid </FONT><A HREF="poslinsex.html"><FONT FACE="Arial">objektsavst&aring;nd 35 resp 50mm</FONT></A><FONT FACE="Arial"> och kolla med linsformeln att den ger samma resultat.</P><P>Flyttar vi objektet &aring;t h&ouml;ger flyttar sig bilden ocks&aring; &aring;t h&ouml;ger.</P><P>F&ouml;ljer vi den r&ouml;da str&aring;len ser vi vidare <B>att f&ouml;rstoringen (=kvoten mellan bildh&ouml;jd och objektsh&ouml;jd) blir b/a</B>. Detta f&ouml;rstoringsm&aring;tt &auml;r bra n&auml;r vi har reella bilder (projektorer och kameror exvis), men som vi ska se oanv&auml;ndbart i instrument med virtuella bilder (kikare, mikroskop)</P><P>En helt annan situation intr&auml;ffar om vi l&auml;gger objektet innanf&ouml;r fokus (=n&auml;rmre linsen). Nedan finns situationen utritad f&ouml;r f=20mm och objektsavst&aring;nd 15mm.</P></FONT><P><IMG SRC="Image48.gif" WIDTH=552 HEIGHT=210></P><FONT FACE="Arial"><P>Vi ser att str&aring;larna efter linsen g&aring;r is&auml;r dvs det blir ingen reell bild!</P><P>D&auml;remot ser de ut att komma fr&aring;n en punkt.</P><P>Aha!!!!</P><P>Den virtuella bilden!</P><P>G&ouml;r nu sj&auml;lv </FONT><A HREF="virtposex.html"><FONT FACE="Arial">(?)</FONT></A><FONT FACE="Arial"> samma sak fast med a=10mm</P><P>Vi ser att den blir st&ouml;rre &auml;n objektet, allts&aring; har vi ett f&ouml;rstoringsglas. ....eller?</P><P>F&ouml;r att s&auml;ga om bilden blir st&ouml;rre &auml;n objektet i v&aring;ra &ouml;gon m&aring;ste vi avg&ouml;ra vilken vinkel de upptar, och d&aring; kommer avst&aring;ndet ocks&aring; in.</P><P>Nedan tv&aring; figurer d&auml;r vi ser den <A NAME="synvinkel">synvinkel</A> </FONT><B><FONT FACE="Arial" COLOR="#ffff00">(gul) </B></FONT><FONT FACE="Arial">som upptas av objekt resp bild, om betraktaren befinner sig en bit fr&aring;n linsen (som moster Agda g&ouml;r n&auml;r hon tittar p&aring; prinsessorna i &Aring;ret Runt med f&ouml;rstoringsglas) </P></FONT><P><IMG SRC="Image49.gif" WIDTH=551 HEIGHT=250><IMG SRC="Image50.gif" WIDTH=550 HEIGHT=187></P><FONT FACE="Arial"><P>F&ouml;rh&aring;llandet mellan dessa vinklar (vinkel med resp utan instrument) kallas <A NAME="vinkelförstoring">vinkelf&ouml;rstoring</A> och &auml;r det meningsfulla s&auml;ttet att uttrycka f&ouml;rstoring i ett instrument med virtuell bild</P><P>L&auml;gger vi &ouml;gat alldeles intill linsen f&aring;r vi vinkelf&ouml;rstoringen 1, men &auml;ven detta kan vara anv&auml;ndbart:</P><P>L&auml;gg objektet alldeles intill &ouml;gat (25mm avst). Det upptar nu en stor synvinkel, men vi ser det inte &auml;nd&aring; (tusan s&aring; f&ouml;rargligt) d&auml;rf&ouml;r att vi inte kan se skarpt (=ackommodera) p&aring; det avst&aring;ndet. Tar vi nu en lins med fokall&auml;ngd 25mm (flytta inte p&aring; objektet under tiden) och placerar den mellan objekt och &ouml;ga kommer bilden att flyttas ut till stort avst&aring;nd med bibeh&aring;llande av den fina synvinkeln.</P><P>Luppen har allts&aring; vinkelf&ouml;rstoringen 1 om den anv&auml;nds p&aring; detta s&auml;tt.</P><P>D&auml;refter ska vi kolla om vi begripit hur det fungerar i en negativ lins.</P><P>F&ouml;rs&ouml;k rita alla str&aring;lar till ett objekt 40mm f&ouml;re en lins med fokall&auml;ngd -30mm.</P><P>Kolla d&auml;refter resultatet med linsformeln.</P></FONT><P><A HREF="negbilex.html"><FONT FACE="Arial">Fusk</FONT></A><FONT FACE="Arial"> bestraffas med f&auml;rdigritad str&aring;lg&aring;ng.</P><P>Om objektet best&aring;r av flera punkter, vilket de flesta objekt g&ouml;r finns det exakt en r&ouml;d, en gr&ouml;n och en bl&aring; str&aring;le fr&aring;n varje punkt som g&aring;r ihop i motsvarande punkt i bilden. Jfr f&ouml;ljande fig (fritt Picasso)</P></FONT><P><IMG SRC="Image46.gif" WIDTH=525 HEIGHT=211></P><FONT FACE="Arial"><P>Alla punkter p&aring; objektet ger allts&aring; str&aring;lar som g&aring;r genom alla punkter i linsen!</P><P>...va sa han nu???? T&auml;nk efter (med hj&auml;lp av figuren), det &auml;r v&auml;sentligt f&ouml;r det som kommer att s&auml;gas om avbildningskvalitet s&aring; sm&aring;ningom.</P><P>Till </FONT><A HREF="../sida4/Huvudsid4-2.html"><FONT FACE="Arial">n&auml;sta sida</FONT></A><FONT FACE="Arial"> (Huvudplansbegreppet) Hela denna sida &auml;r niv&aring; 2 och 3</P><P>Till </FONT><A HREF="../sida5/Huvudsid5-2.html"><FONT FACE="Arial">n&auml;sta niv&aring;-1-sida</FONT></A><FONT FACE="Arial"> (Kikaren och teleskopet)</P><P>Till </FONT><A HREF="../../kap2/sida1/Huvudsid1-2.html"><FONT FACE="Arial">n&auml;sta kapitel</FONT></A><FONT FACE="Arial"> (Begr&auml;nsningar i optiska system)</P><P>Till </FONT><A HREF="../../inledning/index.html"><FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT></A></P><FONT FACE="Arial"><P>&nbsp;</P><P>&nbsp;</P><P>&nbsp;</P><P>&nbsp;</P></FONT></BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap1/sida3/huvudsid3.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:41:45 GMT -->
</HTML>