<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap3/sida2/huvudsid2.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:06 GMT -->
<HEAD><META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252"><TITLE>huvudsid2</TITLE><META NAME="Version" CONTENT="8.0.3410"><META NAME="Date" CONTENT="10/11/96"><META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\HTML.DOT"></HEAD><BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff"><B><FONT FACE="Arial" SIZE=4><P>Lasern str&aring;legenskaper</P><IMG SRC="Image109.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=389 HEIGHT=240> </B></FONT><FONT FACE="Arial"><P>Laserstr&aring;lens tv&auml;rsnitt uppvisar vad vi brukar kalla en gaussisk profil dvs intensiteten avtar gradbis med &ouml;kande radie s&aring;som i figuren. Det &auml;r d&auml;rf&ouml;r sv&aring;rt att definiera en exakt radie. man har som konvention (egentligen av matematiska sk&auml;l) valt att definiera str&aring;lradien (=w) som den radie d&auml;r intensiteten g&aring;tt ner en faktor e² (=7.4) fr&aring;n sitt maxv&auml;rde i mitten av str&aring;len. Innanf&ouml;r denna radie ligger 94% av energin, och den &auml;r d&auml;rf&ouml;r ett bra m&aring;tt p&aring; hur stor yta energin &auml;r spridd &ouml;ver. D&auml;remot kan man inte dra n&aring;gon slutsats om hur stor en &ouml;ppning eller en lins ska vara f&ouml;r att sl&auml;ppa igenom str&aring;len direkt fr&aring;n w, eftersom man f&aring;r </FONT><A HREF="../../kap2/sida2/huvudsid2.html"><FONT FACE="Arial">diffraktion</FONT></A><FONT FACE="Arial"> i linsen &auml;ven om den sk&auml;r utanf&ouml;r w. Som tumregel brukar man ta att dubbla w i &ouml;ppningsradie g&ouml;r att str&aring;len blir praktiskt taget op&aring;verkad av diffraktion.</P><P>N&auml;r man talar om str&aring;lens divergens menar man &ouml;kningen i w per avst&aring;nd fr&aring;n lasern, m&auml;tt i mrad. Detta g&auml;ller egentligen bara p&aring; stort avst&aring;nd fr&aring;n lasern (se niv&aring; 2 nedan), men allm&auml;nnt g&auml;ller att divergens ges av <IMG SRC="Image112.gif" WIDTH=73 HEIGHT=24>d&auml;r w<SUB>0</SUB> &auml;r str&aring;lens w-radie precis vid utkopplingen ur lasern.</P><P>Ex: Hur stor blir den intensiteten i en spot belyst av en 10mW HeNe laser med v&aring;gl&auml;ngd 633nm p&aring; 100m avst&aring;nd om w<SUB>0</SUB>=0.50mm? </FONT><A HREF="spot100m.html"><FONT FACE="Arial">Joo..</FONT></A></P><FONT FACE="Arial"><P>Laserljus &auml;r vidare ofta pulsat (f&ouml;r att en detektor l&auml;ttare ska k&auml;nna igen det i en stark, brusig bakgrund av solljus och andra inkoherenta ljusk&auml;llor), med <A NAME="prf">pulsrepetionsfrekvens</A> (PRF) menar man d&aring; antal pulser per sekund, ett v&auml;rde som f&ouml;r en m&auml;tlaser typiskt ligger runt 1kHz.</P><P>Pulsl&auml;ngden T, beror av vilken mekanism man anv&auml;nt f&ouml;r att pulsa ljuset, men med en av de vanligaste (Q-switchning, niv&aring; 2 nedan f&ouml;rst&aring;ss, vad annars?) blir den typiskt ca 20ns.</P><P>Sambandet mellan laserns medeleffekt och pulsens toppeffekt blir d&aring;:</P><P><IMG SRC="Image114.gif" WIDTH=168 HEIGHT=41></P><P>Ur topp- och medeleffekt f&aring;r man sedan resp intensitet genom att dela med belyst fl&auml;cks yta</P></FONT><B><FONT FACE="Arial" SIZE=5><P>Str&aring;legenskaper niv&aring; 2</P></B></FONT><FONT FACE="Arial"><P>Vi lj&ouml;g (eller undanh&ouml;ll sanningen) p&aring; f&ouml;rra sidan. Man anv&auml;nder aldrig plana speglat i en alser eftersom vinkelinjusteringskraven skulle bli alldeles f&ouml;r stora f&ouml;r en komersiell produkt (ngn µrad dvs ett granbarr p&aring; 1km beh&ouml;vs). Bakre spegeln &auml;r allts&aring; svagt kr&ouml;kt. Detta har tv&aring; konsekvenser:</P><P>Str&aring;lens intensitet f&aring;r en Gaussisk f&ouml;rdelning dvs <IMG SRC="Image115.gif" WIDTH=94 HEIGHT=28>, vilket ger den intensitetf&ouml;rdelning som framg&aring;r av plotten ovan.</P><P>Str&aring;lens smalaste punkt (d&auml;r w=w<SUB>0</SUB>) kommer att ligga vid utkopplingsspegeln. Vi v&auml;ljer detta som utg&aring;ngspunkt f&ouml;r en z-axel utmed str&aring;len, dvs z=0 vid utkopplingsspegeln.</P><P><IMG SRC="Image116.gif" WIDTH=357 HEIGHT=131></P><IMG SRC="Image117.gif" ALIGN="LEFT" HSPACE=12 WIDTH=402 HEIGHT=154> <P>Det kommer att finnas o&ouml;nskade v&auml;gar f&ouml;r ljuset att lasra (=uppleva rundg&aring;ng) som kan f&ouml;rst&ouml;ra str&aring;len kvalitet om man inte begr&auml;nsar deras framfart. Exempelvis kan ljuset studsa varannann g&aring;ng i &ouml;verdel av den kr&ouml;kta spegeln och varannan g&aring;ng i underdel. Detta skulle ju en utkopplad str&aring;le som ser ut som den gr&ouml;na tr&auml;ffbilden i fig (i motsats till den r&ouml;da som &auml;r den man vill ha). En mer komplicerad tredimensionell variant &auml;r den bl&aring;. Dessa o&ouml;nskade ljusf&ouml;rdelningar brukar kallas h&ouml;gre transversella moder och bek&auml;mpas enklast med en apertur placerad n&auml;ra utkopplingsspegeln som ger st&ouml;rre f&ouml;rluster f&ouml;r de h&ouml;gre moderna &auml;n f&ouml;r grundmoden (=den &ouml;nskade som brukar kallas TEM<SUB>00</SUB>). <A NAME="modrenhet">Modrenhet</A> &auml;r allts&aring; en viktigt kvalitetsm&aring;tt och brukar kvantifieras som hur m&aring;nga procent av ljuset som ligger i TEM<SUB>00.</P><IMG SRC="Image118.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=516 HEIGHT=256> </SUB><P>Det finns en annan typ av moder som kallas longitudinella som har med v&aring;gl&auml;ngdsrenhet att g&ouml;ra. Dessa uppkommer d&auml;rf&ouml;r att den v&aring;gl&auml;ngd som "kan lasra", dvs kan bli f&ouml;rst&auml;rkt av ett givet lasermaterial, inte &auml;r exakt definierad utan har en viss spridning, oftast av storleksordning 0.01-0.1nm. F&ouml;rst&auml;rkningen som funktion av v&aring;gl&auml;ngd ser d&aring; ut som den svarta kurvan i fig, spridd runt en mittv&aring;gl&auml;ngd. </P><P>&nbsp;</P><P>F<SUB>T</SUB> i figuren &auml;r den f&ouml;rst&auml;rkning som &auml;r tillr&auml;cklig f&ouml;r att kompensera f&ouml;rlusterna genom utkopplingsspegeln, dvs 1/R. Enbarft de v&aring;gl&auml;ngder d&auml;r f&ouml;rst&auml;rkningen (F) &auml;r st&ouml;rre &auml;n denna tr&ouml;skel kan lasra. men det finns ett villkor till. </FONT><FONT FACE="Wingdings">L</FONT><FONT FACE="Arial"> Enbart v&aring;gl&auml;ngder f&ouml;r vilka en rundtripp i laser &auml;r ett helt antal v&aring;gl&auml;ngder kan lasra, annars skulle str&aring;len i kaviteten interferera destruktivt med sig sj&auml;lv efter ett varv.</P><IMG SRC="Image119.gif" ALIGN="LEFT" HSPACE=12 WIDTH=379 HEIGHT=232> <P>Villkoret blir allts&aring; att 2L =p</FONT><FONT FACE="Symbol">l </FONT><FONT FACE="Arial">(eller hur). Detta inneb&auml;r att ngt tiotal s&aring;dana v&aring;gl&auml;ngder f&aring;r plats under den del av f&ouml;rst&auml;rkningskurva som ligger &ouml;ver tr&ouml;skel. Varf&ouml;r? F&ouml;r vanliga till&auml;mpningar och vanliga lasrar har detta ingen betydelse. Men f&ouml;r halvledarlasrar (med l&auml;ngder runt 100µm) och i avst&aring;ndsm&auml;tningar med stora noggrannhetskrav &auml;r det v&auml;sentligt.</P><P>L&ouml;ser man v&aring;gekvationen f&ouml;r laserkaviteten kommer man fram till att str&aring;len w-radie runt en midja beter sig som </P><P><IMG SRC="Image120.gif" WIDTH=156 HEIGHT=60></P><P>d&auml;r z=0 vid midjan, till exempel vid utkopplingsspegeln, men ocks&aring; vid den midja som uppkommer om man fokuserar str&aring;len mha en lins. Plottar man w(z) f&aring;r man:</P><P>Midjan g&aring;r allts&aring; asymptotiskt mot den streckade linjen som har ekvationen </P><P><IMG SRC="Image121.gif" WIDTH=80 HEIGHT=24></P><P>(F&ouml;rsumma ettan i ekvationen och r&auml;kna p&aring;! F&ouml;r tillr&auml;ckligt stora z blir ettan ov&auml;sentlig)</P><P>Linjens vinkel med symmetriaxeln brukar kallas str&aring;lens <A NAME="divergens">divergens</A>, men g&auml;ller egentligen bara d&aring; ettan kan f&ouml;rsummas. N&auml;r kan det det d&aring;??</P><P>Ett bra m&aring;tt &auml;r det v&auml;rde p&aring; z som g&ouml;r parantesen i rotuttrycket =1. Kalla detta z-v&auml;rde f&ouml;r z<SUB>0</SUB> eller sk&auml;rpedjup. N&auml;r z&gt;z<SUB>0</SUB> g&auml;ller divergensuttrycket. N&auml;r z&lt;z<SUB>0 </SUB>&auml;r w mer eller mindre konstant. (mellan tummen och pekfingret i alla fall). S&aring; hur stort blir det nu d&aring;? Jo s&auml;tt parantesen =1 s&aring; f&aring;r vi <IMG SRC="Image122.gif" WIDTH=84 HEIGHT=25></P><P>&Ouml;kar vi str&aring;lens radie vi utkopplingsspegeln f&aring;r vi allts&aring; l&auml;ngre sk&auml;rpedjup och mindre divergens. </P><P>R&auml;kna sj&auml;lv ut dessa v&auml;rden f&ouml;r en HeNe-laser med v&aring;gl&auml;ngd 633nm och spotsize =0.3mm.</P><IMG SRC="Image123.gif" ALIGN="LEFT" HSPACE=12 WIDTH=448 HEIGHT=396> <P>Om man skulle expandera str&aring;len en faktor 10 blir allts&aring; sk&auml;rpedjupet 100ggr l&auml;ngre och divergensen en tiondel s&aring; stor. Sambandet ovan g&auml;ller &auml;ven vid fokusering:</P><P>S&auml;tt str&aring;lradien in mot den fokuserande linsen till w<SUB>in</P></SUB><P>D&aring; blir </FONT><FONT FACE="Symbol">q=</FONT><FONT FACE="Arial"> w<SUB>in</SUB>/f vilket kombineras med v&aring;rt tidigare uttryck f&ouml;r </FONT><FONT FACE="Symbol">q </FONT><FONT FACE="Arial">varur vi f&aring;r</P><IMG SRC="Image124.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=70 HEIGHT=45> <P>&nbsp;</P><P>&nbsp;</P><P>Nu kan inte str&aring;lradien g&ouml;ras st&ouml;rre &auml;n halva linsradien utan att f&aring; </FONT><A HREF="../../kap2/sida2/huvudsid2.html"><FONT FACE="Arial">diffraktion</FONT></A><FONT FACE="Arial">, och fokall&auml;ngden kan inte g&ouml;ras kortare &auml;n dubbla radien. </P><P>Vilket ger oss att den minsta spot man &ouml;verhuvudtaget kan f&aring; &auml;r en dryg v&aring;gl&auml;ngd i w-radie. Eller hur?</P><P>Exempel:</P><P>Man vill (av oklara sk&auml;l , gissa sj&auml;lv) skapa en s&aring; liten laserfl&auml;ck som m&ouml;jligt p&aring; 20km avst&aring;nd, med en Nd:YAG-laser, v&aring;gl&auml;ngd 1064nm. Hur stor ska str&aring;len vara n&auml;r den l&auml;mnar laser med teleskop, och hur stor blir den vid m&aring;let?</P><P>Ledning: w &auml;r en funktion av w<SUB>0</SUB>, som ska minimeras. L &auml;r 20km = konstant!</P><P></FONT><A HREF="minspot.html"><FONT FACE="Arial">S&aring; h&auml;r gjorde jag</FONT></A><FONT FACE="Arial">.</P></FONT><B><FONT FACE="Arial" SIZE=4><P>Pulsning</P></B></FONT><FONT FACE="Arial"><P>Det finns tv&aring; vanliga metoder f&ouml;r pulsning. Den i m&auml;tsammanhang viktigaste kallas <A NAME="qswitch">Q-switchning </A>och bygger p&aring; att man hindrar lasern fr&aring;n att lasra under en tid (storleksordning 100µs) genom att helt enkelt blockera str&aring;lens v&auml;g i laserkaviteten. F&ouml;rst&auml;rkningen kan d&aring; genom </FONT><A HREF="../sida1/huvudsid1.html#pumpning"><FONT FACE="Arial">pumpningen</FONT></A><FONT FACE="Arial"> v&auml;xa till v&auml;rden mycket st&ouml;rre &aring;n 1/&aring;terkopplingen = 1/R som den </FONT><A HREF="../sida1/huvudsid1.html#rundg"><FONT FACE="Arial">annars</FONT></A><FONT FACE="Arial"> &auml;r begr&auml;nsad av. Resultatet blir att n&auml;r kavitetsblockeringen v&auml;l tas bort &auml;r f&ouml;rs&auml;rkningen s&aring; stor att str&aring;len v&auml;xer till mycket stora intensiteter under ngn enstaka rundtrippstid i kaviteten (2-3ns). Denna h&ouml;gintensiva str&aring;le t&ouml;mmer helt ut niv&aring; 2 p&aring; elektroner (</FONT><A HREF="../sida1/huvudsid1.html#stimemis"><FONT FACE="Arial">eftersom</FONT></A><FONT FACE="Arial"> stimulerad emission var prop mot intensiteten). "All" lagrad energi i atomerna blir allts&aring; ljus inom en mycket kort tidsrymd. D&auml;refter l&auml;cker 20% (eller 1 - R om R har annat v&auml;rde &auml;n 0.8) av denna ut varje rundtripp. Man f&aring;r allts&aring; en laserpuls vars intensitet stiger under ca 2-5ns och sedan avtar under 10-50ns. Toppeffekten i denna brukar ligga p&aring; ca 10000ggr effekten av samma laser k&ouml;rd kontinuerligt. Medeleffekten sjunker allts&aring; ganska lite trots att laser hindras fr&aring;n att lasra under st&ouml;rre delen av tiden</P><P>Ett annat fenomen som bygger interferens mellan moderna (sv&auml;vning) kallas modl&aring;sning och ger pulser med l&auml;ngd 10-100ps och </FONT><A HREF="#prf"><FONT FACE="Arial">PRF</FONT></A><FONT FACE="Arial"> (vad var det nu igen?) p&aring; hundratals MHz</P><P>&nbsp;</P><P>Till </FONT><A HREF="../sida3/huvudsid3.html"><FONT FACE="Arial">n&auml;sta sida</FONT></A><FONT FACE="Arial"> (Lasertyper)</P><P>Till </FONT><A HREF="../../kap4/sida1/huvudsid1.html"><FONT FACE="Arial">n&auml;sta kapitel</FONT></A><FONT FACE="Arial"> (V&aring;goptik) </FONT><FONT FACE="Arial" COLOR="#ff0000">(enbart niv&aring; 2+3)</P></FONT><FONT FACE="Arial"><P>Till </FONT><A HREF="file:///E:/kap5/sida1/huvudsid1.htm"><FONT FACE="Arial">n&auml;sta niv&aring;-1 kapitel</FONT></A><FONT FACE="Arial"> (Modern optronik)</P><P>Till </FONT><A HREF="../../inledning/index.html"><FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT></A></P><FONT FACE="Arial"></FONT></BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap3/sida2/huvudsid2.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:10 GMT -->
</HTML>