<HTML>


<HEAD>
    <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
    <TITLE>huvudsid4</TITLE>
    <META NAME="Version" CONTENT="8.0.3410">
    <META NAME="Date" CONTENT="10/11/96">
    <META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\HTML.DOT">
</HEAD>

<BODY LINK="#0000ff" BGCOLOR="#ffffff"><B>
        <FONT FACE="Arial" SIZE=5>
            <P>Gitter</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>En mycket vanlig optisk komponent (b&aring;de avsiktligt och oavsiktligt) &auml;r gitter (eng. Gratings). Den
            &auml;r en kombinationstill&auml;mpning av interferens och diffraktion, som ofta anv&auml;nds n&auml;r man
            vill analysera v&aring;gl&auml;ngdssammans&auml;ttningen p&aring; ljus.En liten figur:</P>
        <P><IMG SRC="gitter.jpg" WIDTH=571 HEIGHT=388></P>
        <P>Ljus kommer in mot en glasplatta i vilket parallella repor gjorts</P>
        <P>(Alternativt kan genomsl&auml;ppligheten f&ouml;r ljus f&ouml;rst&ouml;rts p&aring; annnat s&auml;tt, det
            viktiga &auml;r att ljuset inte kommer igenom)</P>
        <P>Den oskadade delen av glasen bildar avl&aring;nga strimmor (=
    </FONT><A HREF="../../kap2/sida2/matbesk2.html">enkelspalter</A>
    <FONT FACE="Arial">)) som sprider ljus en en vinkel </FONT>
    <FONT FACE="Arial" COLOR="#ff0000">(r&ouml;d)</FONT>
    <FONT FACE="Arial"> som grovt ges av </P>
        <P><IMG SRC="Image570.gif" WIDTH=100 HEIGHT=45>'</P>
        <P>d&auml;r b = bredden av det oskadade omr&aring;det = spaltbredd.</P>
        <P>Fr&aring;n var och en av strimmorna sprids nu ljus i likadana vinklar. Dessa ljusf&auml;lt kommer snart att
            &ouml;verlappa och interfererar d&aring; sinsemellan. Om mittpunktsavt&aring;ndet mellan tv&aring; spalter
            &auml;r d kommer v&auml;gskillnaden mellan
    </FONT>
    <FONT FACE="Arial" COLOR="#000080">str&aring;lar fr&aring;n intilliggande &ouml;ppningar (bl&aring;)</FONT>
    <FONT FACE="Arial"> att bero av vinkeln som </P>
        <P><IMG SRC="Image571.gif" WIDTH=82 HEIGHT=18></P>
        <P>F&ouml;r att tv&aring; intilliggande str&aring;lar (och d&auml;rmed alla andra ocks&aring;) ska interferera
            konstruktivt ska denna v&auml;gskillnad vara ett helt antal v&aring;gl&auml;ngder dvs </P>
        <P><IMG SRC="Image572.gif" WIDTH=157 HEIGHT=41></P>
        <P>F&ouml;r alla andra vinklar blir det meller mindre m&ouml;rkt, beroende p&aring; att antalet spalter &auml;r
            s&aring; stort att s&aring; fort v&auml;gskillanden avviker det minsta fr&aring;n ett heltal finns det en
            spalt en bit &aring;t sidan som ligger i motfas mot den f&ouml;rsta. </P>
        <P>Matematiskt beskrivs det f&ouml;rsta f&ouml;rloppet av uttrycket f&ouml;r diffraktion i enkelspalt</P>
        <P><IMG SRC="Image573.gif" WIDTH=142 HEIGHT=58></P>
        <P>och uttrycket f&ouml;r f&ouml;r f&auml;ltf&ouml;rdelningen som funktion av vinkel f&ouml;r interferensen.
            (H&auml;rledning)</P>
        <P><IMG SRC="Image575.gif" WIDTH=145 HEIGHT=44></P>
        <P>I nedanst&aring;ende figur visas intensitetsf&ouml;rdelningen f&ouml;r tre v&aring;gl&auml;ngder
    </FONT><B>
        <FONT FACE="Arial" COLOR="#000080">450nm
    </B></FONT>
    <FONT FACE="Arial">, </FONT><B>
        <FONT FACE="Arial" COLOR="#00ff00">550nm
    </B></FONT>
    <FONT FACE="Arial"> och </FONT><B>
        <FONT FACE="Arial" COLOR="#ff0000">650nm,
    </B></FONT>
    <FONT FACE="Arial">d=2000nm, b=500nm och 100 spalter.</P>
        <P><IMG SRC="Image576.gif" WIDTH=560 HEIGHT=412></P>
        <P>&nbsp;</P>
        <P>Om vi g&ouml;r samma sak f&ouml;r 20 spalter blir det i st&auml;llet s&aring; h&auml;r</P>
        <P><IMG SRC="Image577.gif" WIDTH=560 HEIGHT=412></P>
        <P>Man ser att maxima har blivit bredare dvs f&auml;rguppdelningen har blivit s&auml;mre.</P>
        <P>Till
    </FONT><A HREF="../../kap5/sida1/huvudsid1.html">n&auml;sta kapitel</A>
    <FONT FACE="Arial"> (Modern optronik)</P>
        <P>Till
    </FONT><A HREF="../../inledning/index.html">inneh&aring;llsf&ouml;rteckningen</A></P>
    <FONT FACE="Arial"></FONT>
</BODY>


</HTML>