<HTML>


<HEAD>
    <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
    <TITLE>huvudsid3</TITLE>
    <META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\HTML.DOT">
</HEAD>

<BODY LINK="#0000ff" VLINK="#800080"><B>
        <FONT FACE="Arial" SIZE=7>
            <P ALIGN="CENTER">Ickelinj&auml;r optik</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>I de allra flesta situationer &auml;r ljus ett linj&auml;rt fenomen, dvs tv&aring; eller flera ljusf&auml;lt
            kan g&aring; igenom varandra&ouml;verlappa eller t.o.m. krocka utan att n&aring;got h&auml;nder
    </FONT><A HREF="../ch4/page2/huvudsid2.html">
        <FONT FACE="Arial">. Interferens</FONT>
    </A>
    <FONT FACE="Arial"> (d&auml;r ju flera f&auml;lt samverkar) inneb&auml;r att man vid detektion ser effekter av
        b&auml;gge f&auml;ltens samverkan, men inte att det ena styr det andra eller &ouml;verg&aring;r i det andra).
        </P>
        <P>Vid h&ouml;ga lasereffektkoncentrationer och/eller i vissa material &auml;r detta emellertid inte sanning
            l&auml;ngre, utan ljusstr&aring;lar kan f&ouml;r&auml;ndras. F&ouml;r att detta ska ske m&aring;ste
            materialet ljuset passerar genom delta. Vi anv&auml;nder h&auml;r en f&ouml;rklringsmodell som liknar den
    </FONT><A HREF="../../bok/kap4/sida1/huvudsid1.html#brytnind">
        <FONT FACE="Arial">vi anv&auml;nde i kap 4</FONT>
    </A>
    <FONT FACE="Arial"> f&ouml;r att f&ouml;rklara brytningsindex. </P>
        <P>D&auml;r sade vi bland annat att vanligt brytningsindex (inbromsning av ljuset) uppkommer pga att en foton
            som kommer tillr&auml;ckligt n&auml;ra en atom stannar upp f&ouml;r att genomf&ouml;ra en
            handskakningsprocess, varefter den &aring;teruts&auml;nds i samma riktning och med samma &ouml;vriga
            egenskaper den hade innan h&auml;ndelsen, bara n&aring;got f&ouml;rsenad. Den tid atomen hade p&aring; sig
            f&ouml;r handskakningsprocessen ligger i storleksordningen femtosekunder.</P>
        <P>Om nu tv&aring; fotoner tr&auml;ffar samma atom under denna mycket korta tid kan b&auml;gges energi lagras i
            atomen under den mycket korta tiden, och n&auml;r denna l&ouml;pt ut uts&auml;nds ljusenergin som en foton
            (inte tv&aring;) vilket utifr&aring;n sett verkar vara en fusion av atomer. Denna fusion intr&auml;ffar bara
            om b&aring;de energi och r&ouml;relsem&auml;ngd kan bevaras vid h&auml;ndelsen.</P>
        <P>I de tillf&auml;llen detta g&aring;r &ouml;ppnar sig emellertid en helt ny flora av fenomen. Man kan
            g&ouml;ra frekvensdubbling (som i exemplet ovan) dvs ljus kan ges kortare v&aring;gl&auml;ngd. Man kan
            generera skillnadsfrekvenser och summafrekvensen.</P>
        <P>..och kanske viktigare: man kan f&ouml;rst&auml;rka ljus med responstider som ligger storleksordningar under
            de man f&aring;r i en laserf&ouml;rst&auml;rkare. F&ouml;r att f&ouml;rst&aring; m&ouml;jlghet och problem
            m&aring;ste vi nog dyka ner i lite matte:</P>
    </FONT><B>
        <FONT FACE="Arial" SIZE=4>
            <P>Niv&aring; 2</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>Antag att vi har ett material d&auml;r dipolernas sv&auml;ngning (se kap 4 igen) har ett kvadratiskt boidrag
            av E-f&auml;ltet (f&ouml;rutom det vanliga linj&auml;ra). Vad uppkommer d&aring; f&ouml;r fenomen?</P>
    </FONT>
    <P><IMG SRC="Image361.gif" WIDTH=516 HEIGHT=48></P>
    <FONT FACE="Arial">
        <P>Vi f&aring;r tydligen ett bidrag som sv&auml;nger med dubbla frekvsen dvs halva v&aring;gl&auml;ngden. Detta
            inneb&auml;r att materialets dipoler sv&auml;nger med den frekvensen. Om denna sv&auml;ngning kan
            &aring;stadkomma en ljusv&aring;g vid den nya frekvensen beror p&aring; om dipolerna i hela materialet
            sv&auml;nger i takt med denna nya v&aring;g. Kravet p&aring; att de ska g&ouml;ra s&aring; kallas <A
                NAME="fasmatch">fasmatchningskravet</A>. I ord kan detta uttryckas som att v&aring;gl&auml;ngden
            f&ouml;r dipolernas sv&auml;ngning m&aring;ste motsvara dubbelfrekvensens v&aring;gl&auml;ngd, dvs:</P>
    </FONT>
    <P><IMG SRC="Image362.gif" WIDTH=360 HEIGHT=49></P>
    <FONT FACE="Arial">
        <P>dvs det blir en ny v&aring;g om brytningsindex inte varierar med v&aring;gl&auml;ngden p&aring; ljuset.
            S&aring;dana material finns inte! Detta inneb&auml;r inte att vi kan st&auml;nga butiken och g&aring; hem,
            utan att vi m&aring;ste anv&auml;nda material med
    </FONT><A HREF="../../kap4/sida3/cp_ep.html#dubbelbr">
        <FONT FACE="Arial">dubbelbrytning</FONT>
    </A>
    <FONT FACE="Arial"> (eller komma p&aring; n&aring;got &auml;nnu mer exotiskt).</P>
        <P>&Auml;ven f&ouml;r dubbelbrytande material st&auml;lls ganska stora krav: Materialets dispersion och
            dubbelbrytning m&aring;ste exakt kompensera varandra mellan grundton och &ouml;verton; Sannolikheten
            f&ouml;r ickelinj&auml;ra processer m&aring;ste vara stor.</P>
        <P>Det finns emelletid material d&auml;r detta kan ske i synnerhet om man kan laborera med olika
            propagationsriktningar och polarisationsriktningar som inte ligger parallellt med eller vinkelr&auml;tt mot
            optiska axeln.</P>
        <P>Man brukar dela in ickelinj&auml;r optik i olika ordningar, matematiskt beroende p&aring; i vilken potens det
            elektriska f&auml;ltet p&aring;verar dipolernas oscillation i materialet. Linj&auml;r optik &auml;r av
            f&ouml;rsta ordningen, Frekvensdubbling (SHG=Second Harmonic Generation) som i exemplet ovan, beror
            kvadratiskt av det elektriska f&auml;ltet och &auml;r f&ouml;ljaktligen av andra ordningen.
            Tredjeordningsprocesser &auml;r viktiga d&auml;rf&ouml;r att de kan ske i alla typer av material. Detta i
            motsats till andra ordningens fenomen som kan kan intr&auml;ffa i material med en viss typ av
            kristallassymetri. </P>
        <P>Denna matematik har emellertid en viktig fysikalisk konsekvens: Antalet fotoner som &auml;r inblandade
            &auml;r alltid lika med ordningen + 1. Linj&auml;ra processer &auml;r allts&aring;
            tv&aring;-foton-processer, men eftersom vi st&auml;ller kravet att b&aring;de energi och
            r&ouml;relsem&auml;ngd ska bevaras kommer den inkommande fotonen och den utg&aring;ende att vara helt lika
            och det enda som kan observeras &auml;r en f&ouml;rsening, dvs det vi normalt f&ouml;rknippar med
            brytningsindex. Kvadratiska termer ger upphov till tre-fotonprocesser d&auml;r summa-frekvensgenerering och
            dess specialfall SHG &auml;r bra exempel p&aring; n&auml;r tv&aring; fotoner sl&aring;s samman till en.
            Motsatsen dvs en inkommande foton delas upp i tv&aring; utg&aring;ende f&ouml;rekommer ocks&aring;, och
            intr&auml;ffar n&auml;r tv&aring; ljusf&auml;lt med olika frekvens &ouml;verlappar varandra i ett
            ickelinj&auml;rt material. Energi tappas d&aring; fr&aring;n den v&aring;g som har h&ouml;gst frekvens och
            &ouml;verf&ouml;r till den som har l&auml;gre. Den energi som d&aring; blir &ouml;ver skapar ett nytt
            (tredje) f&auml;lt vars frekvens blir skillnaden mellan de ursprunliga dvs v&aring;gl&auml;ngderna
            f&ouml;rh&aring;ller sig som:</P>
    </FONT>
    <P><IMG SRC="Image365.gif" WIDTH=252 HEIGHT=58></P>
    <FONT FACE="Arial">
        <P>Denna process anv&auml;nds ofta i s.k. optiska parametriska f&ouml;rst&auml;rkare (OPA) d&auml;r den
            h&ouml;ga frekvensen best&aring;r av en kraftig "pump"-laser och den l&auml;gre ("signal") kommer att
            f&ouml;rst&auml;rkas. Det intressanta i sammanhanget &auml;r att alla typer av modulation i signalen kommer
            att bevaras vid f&ouml;rst&auml;rkningen som allts&aring; blir ett intressant alterantiv f&ouml;r
            f&ouml;rs&auml;rkning av exvis modulerade signaler i optiska fibrer.</P>
    </FONT>
    <P><IMG SRC="Image366.gif" WIDTH=553 HEIGHT=14></P>
    <FONT FACE="Arial">
        <P>Till
    </FONT><A HREF="../../inledning/index.html">
        <FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT>
    </A></P>
    <FONT FACE="Arial">
        <P>Till
    </FONT><A HREF="../sida4/huvudsid4.html">
        <FONT FACE="Arial">n&auml;sta sida</FONT>
    </A>
    <FONT FACE="Arial"> (Faskonjugering)</P>
    </FONT>
</BODY>


</HTML>