<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap2/sida2/huvudsid2.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:41:55 GMT -->
<HEAD><META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252"><TITLE>Diffraktion</TITLE><META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\html.dot"></HEAD><BODY LINK="#0000ff" VLINK="#800080"><B><FONT FACE="Arial" SIZE=5><P ALIGN="CENTER">Diffraktion</P></B></FONT><FONT FACE="Arial"><P>N&auml;r ljus passerar genom en &ouml;ppning av n&aring;got slag sprids det. Den vinkel det sprids med blir st&ouml;rre ju mindre &ouml;ppningen &auml;r.</P><P>Allm&auml;nnt kan s&auml;gas att spridningen i vinkel ges av </P><P><IMG SRC="Image79.gif" WIDTH=248 HEIGHT=22>f&ouml;r en spalt och en cirkul&auml;r &ouml;ppning respektive. Detta ger spridningen p&aring; stort avst&aring;nd fr&aring;n &ouml;ppningen men ocks&aring; i fokus till en lins (eller ett linssystem).</P><P>Radien p&aring; bilden av en punktk&auml;lla (stj&auml;rna) avbildad i en lins med fokall&auml;ngd f och diameter D blir allts&aring; </P><P><IMG SRC="Image80.gif" WIDTH=84 HEIGHT=41></P><P>F&ouml;r ett <A NAME="diffeye">&ouml;ga </A>med fokall&auml;ngd 20mm och pupilldiameter 3mm blir allts&aring; fl&auml;cken p&aring; n&auml;thinnan 4µm i radie. Detta motsvarar ungef&auml;r avst&aring;ndet mellan stavar och tappar i &ouml;gats mest k&auml;nsliga delar. Naturen/Gud/Darwin </FONT><FONT FACE="Arial" COLOR="#ff0000">(stryk de som ej &ouml;nskas) </FONT><FONT FACE="Arial">har allts&aring; inte haft anledning att utveckla b&auml;ttre n&auml;thinna eftersom finare detaljer &auml;n s&aring; aldrig kan avbildas p&aring; n&auml;thinnan.</P><IMG SRC="Image81.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=404 HEIGHT=164> <P>Sambandet ovan g&auml;ller f&ouml;r all elektromagnetisk str&aring;lning dvs &auml;ven n&auml;rm man vill samla ihop "TV-v&aring;gor" fr&aring;n en satellit. Antag en parabol med diameter 400mm och fokall&auml;ngd 400mm. Frekvensen &auml;r 12GHz vilket ger en v&aring;gl&auml;ngd p&aring; 25mm. Vi f&aring;r d&aring; en spot med radie 30mm. Ungef&auml;r s&aring; noga beh&ouml;ver man vara vid utplacering av mikrov&aring;gshuvudet.</P></FONT><B><FONT FACE="Arial" SIZE=4><P>Diffraktion niv&aring; 2</P><IMG SRC="Image82.gif" ALIGN="LEFT" HSPACE=12 WIDTH=288 HEIGHT=192> </B></FONT><FONT FACE="Arial"><P>F&ouml;r att f&ouml;rst&aring; orsaken till diffraktion kan lite historia vara bra. Fenomenet beskrevs f&ouml;rsta g&aring;ngen av holl&auml;ndaren Huygens (han med okularet) som studerade havsv&aring;gor in i Rotterdams hamn. V&aring;gorna gick in genom en liten &ouml;ppning som i fig, men fortsatte inte rakt fram och slog i motsvarande kajkant med full kraft, utan bredde ut sig, och f&ouml;rlorade d&auml;rmed i v&aring;gh&ouml;jd. Man skulle kunna s&auml;ga att det hela beror p&aring; att naturen inte till&aring;ter diskontinuiteter (som att en 1m h&ouml;g v&aring;g skulle sluta pl&ouml;tsligt i sidledd och att vattnet d&auml;rutanf&ouml;r skulle vara kav lugnt)</P><P>Om vi &aring;terg&aring;r till ljus s&aring; &auml;r det en v&aring;g som best&aring;r av ett elektriskt f&auml;lt. Som s&aring;dant "vill" det egentligen breda ut sig &aring;t alla h&aring;ll (jfr f&auml;ltet fr&aring;n en laddning, det &auml;r ju lika i alla riktningar). Att ljus &ouml;verhuvudtaget f&aring;r en riktning beror p&aring; dess v&aring;gnatur.</P><IMG SRC="Image83.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=300 HEIGHT=195> <P>F&ouml;r att f&ouml;rst&aring; hur kan vi titta p&aring; v&aring;gor som r&ouml;r sig i en given riktning (de bl&aring; v&aring;gfronterna i fig). D&aring; fr&aring;gar vi oss (visst g&ouml;r vi det??) vilka delar av v&aring;gfronten som bidrar till en given punkt l&auml;ngst till h&ouml;ger. Alla punkter som ligger utefter den linje som &auml;r vinkelr&auml;t mot v&aring;gfronterna &auml;r f&ouml;rst&aring;ss i fas.</P><P>Men ju st&ouml;rre x vi v&auml;ljer dest mer ur fas ligger de och f&ouml;r st&ouml;rre x kommer de omv&auml;xlande att ligga ur fas och i fas dvs ta ut varandra. Man kan </FONT><A HREF="fresnzon.html"><FONT FACE="Arial">visa</FONT></A><FONT FACE="Arial"> att den del som ligger i fas ges av att <IMG SRC="Image84.gif" WIDTH=60 HEIGHT=24>. Denna del av en v&aring;gfront brukar kallas den <A NAME="ff">f&ouml;rsta fresnelzonen</A></P><IMG SRC="Image90.gif" ALIGN="LEFT" HSPACE=12 WIDTH=300 HEIGHT=221> <P>Om vi nu f&ouml;r in ett hinder </FONT><FONT FACE="Arial" COLOR="#ff0000">(det r&ouml;da rakbladet i fig)</FONT><FONT FACE="Arial"> i v&aring;gorna kommer detta att p&aring;tagligt p&aring;verka ljuset i v&aring;r punkt rakt fram n&auml;r bladet kommer in i f&ouml;rsta fresnelzonen. Precis som i fallet med havsv&aring;gorna kommer ljuset att b&ouml;ja av s&aring; att en del av v&aring;gfrpnten blir kr&ouml;kt. Detta i sin tur medf&ouml;r att intensiteten i v&aring;r punkt succesivt kommer att minska n&auml;r rakbladet passerar. Observer att intensiteten inte blir noll d&aring; rakbladet har psserat den r&auml;ta linjen utan strax efter (n&auml;r det f&ouml;rsvinner ut ur f&ouml;rsta fresnelzonen ned&aring;t)</P><P>Denna typ av diffraktion (Fresneldiffraktion) blir som synes (?) ov&auml;sentlig p&aring; stora avst&aring;nd (mycket st&ouml;rre &auml;n spalt&ouml;ppningen). P&aring; l&aring;ngt h&aring;ll har vi i st&auml;llet Fraunhoferdiffraktion som har samma orsak men lite annorlunda resultat. Innan vi tittar p&aring; det ska vi bara konstatera att o&auml;ndligheten kan ligga mycket n&auml;rmre &auml;n man tror. Var ligger den i en kikare till exempel? </FONT><A HREF="kikdiffr.html"><FONT FACE="Arial">Jo…</FONT></A></P><IMG SRC="Image97.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=240 HEIGHT=150> <FONT FACE="Arial"><P></FONT><A HREF="matbesk1.html"><FONT FACE="Arial">Matematisk beskrivning av fresnel och fraunhofer i allm&auml;nnhet</FONT></A></P><FONT FACE="Arial"><P>I denna typ av diffraktion f&aring;r vi allts&aring; spridning i en given vinkel som beror av (enbart) kvoten mellan v&aring;gl&auml;ngd och &ouml;ppningens (linsens) storlek. Uttrycken ovan p&aring; niv&aring; 1 &auml;r approximationer av </P><P><IMG SRC="Image91.gif" WIDTH=165 HEIGHT=41></P><P>vilket &auml;r uttryck f&ouml;r vinklar till f&ouml;rsta minimum i spalt (</FONT><A HREF="matbesk2.html"><FONT FACE="Arial">h&auml;rledning</FONT></A><FONT FACE="Arial">) respektive cirkul&auml;r &ouml;ppning, inom vilka huvuddelen av ljuset hamnar.</P><P>V&aring;gfronterna beter sig i det fallet som i fig nedan</P><P><IMG SRC="Image98.gif" WIDTH=432 HEIGHT=363></P><IMG SRC="Image92.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=323 HEIGHT=276> <P>&Ouml;verg&aring;ngen fr&aring;n fraunhofer till fresneldiffraction kan man se genom att k&ouml;ra en liten </FONT><A HREF="enkspalt.html"><FONT FACE="Arial">matlabsnutt</FONT></A><FONT FACE="Arial">. Man b&ouml;rjar d&aring; med en spalt som &auml;r mycket smal (de r&ouml;da markeringarna i den plot som kommer upp. F&ouml;r varje steg blir sedan spalten bredare vilket g&ouml;r att det blir ett s&auml;mre och s&auml;mre antagande att m&ouml;stret studeras i o&auml;ndligheten. S&aring; sm&aring;ningom b&ouml;rjar f&ouml;rdelningen mer och mer likna det som &auml;r geometrisk optik, dvs en belyst strimma och skugga d&auml;romkring. </P><P>Om vi vill studera mer i detalj vad som h&auml;nder n&auml;r ljuset g&aring;r genom en lins, kan vi studera v&aring;r v&auml;lbekanta stj&auml;rna bl&aring;. Enligt geometrisk optik samlas ljuset mot fokus till linsen, men pga av diffraktion sprids den i en vinkel 2</FONT><FONT FACE="Symbol">q,</FONT><FONT FACE="Arial"> vilket ger en spot med radien </FONT><FONT FACE="Symbol">q</FONT><FONT FACE="Arial">f</P><P>&nbsp;</P><P>&nbsp;</P><P>&nbsp;</P><IMG SRC="Image93.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=324 HEIGHT=284> <P>Nu tar vi stj&auml;rna r&ouml;d och l&aring;ter den komma in snett uppifr&aring;n, en vinkel </FONT><FONT FACE="Symbol">a</FONT><FONT FACE="Arial">. Det blir d&aring; en lika stor spot, f&ouml;rskjuten en str&auml;cka </FONT><FONT FACE="Symbol">a</FONT><FONT FACE="Arial">f ner&aring;t.</P><P>&nbsp;</P><P>&nbsp;</P><P>&nbsp;</P><P>&nbsp;</P><P>&nbsp;</P><P>&nbsp;</P><P>&nbsp;</P><P>&nbsp;</P><IMG SRC="Image94.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=324 HEIGHT=284> <P>Om vi nu tittar p&aring; b&auml;gge stj&auml;rnor samtidigt fr&aring;gar vi oss hur stort </FONT><FONT FACE="Symbol">a</FONT><FONT FACE="Arial"> m&aring;ste vara f&ouml;r att stj&auml;rna r&ouml;d och stj&auml;rna bl&aring; ska vara s&auml;rskiljbara (=uppl&ouml;sta). Lord Rayleigh if&ouml;rde (det t&auml;mligen godtyckliga kriteriet att fl&auml;ckarnas mittpunkter ska ligga &aring;tskiljda med en fl&auml;ckradie (dvs periferin p&aring; den ena ska ligga i centrum p&aring; den andra). Som vi ser ger detta att den minsta uppl&ouml;sbara vinkeln=</FONT><FONT FACE="Symbol">a=q.</P></FONT><FONT FACE="Arial"><P>I fallet med ett dagsljusseende &ouml;ga med diameter p&aring; pupillen 2mm blir detta en vinkel p&aring; 0.3mrad dvs p&aring; 3m &auml;r det absolut b&auml;sta man kan se mm-strecken p&aring; en linjal.</P><P>Man ocks&aring; visa att i ett sammansatt system ges diffraktionen av </FONT><A HREF="../../kap1/sida5/huvudsid5.html#exitpup"><FONT FACE="Arial">uttr&auml;despupillen</FONT></A></P><FONT FACE="Arial"><P>&nbsp;</P><P>Till </FONT><A HREF="../sida3/huvudsid3.html"><FONT FACE="Arial">n&auml;sta niv&aring;-2-sida</FONT></A><FONT FACE="Arial"> (Sk&auml;rpedjup)</P></FONT><FONT FACE="Arial" COLOR="#ff0000"><P>Det finns inga fler niv&aring;-1 sidor i detta kapitel</P></FONT><FONT FACE="Arial"><P>Till </FONT><A HREF="../../kap3/sida1/huvudsid1.html"><FONT FACE="Arial">n&auml;sta kapitel</FONT></A><FONT FACE="Arial"> (Laser och laserteknik)</P><P>Till </FONT><A HREF="../../inledning/index.html"><FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT></A></P></BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap2/sida2/huvudsid2.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:00 GMT -->
</HTML>