<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap2/sida2/matbesk1.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:51 GMT -->
<HEAD><META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252"><TITLE>matbesk1</TITLE><META NAME="Version" CONTENT="8.0.3410"><META NAME="Date" CONTENT="10/11/96"><META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\html.dot"></HEAD><BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff"><B><FONT FACE="Arial" SIZE=5><P>Matematisk beskrivning av de olika diffraktionstyperna</P></B></FONT><FONT FACE="Arial"><P>Det enda man egentligen kan utg&aring; fr&aring;n &auml;r att alla punkter i ett ljusf&auml;lt (allts&aring; inte bara punkter i en &ouml;ppning av ngt slag som det brukar st&aring; i gymnasieb&ouml;ckerna) fungerar som k&auml;llor till sf&auml;riska v&aring;gor. Samverkan mellan olika s&aring;dana punkter i form av diffraktion leder allts&aring; de ljusets alla v&auml;lbekanta egenskaper. </P></FONT><P><IMG SRC="Image409.gif" WIDTH=475 HEIGHT=300></P><FONT FACE="Arial"><P>Vi l&aring;ter nu ljusets huvudutbredningsriktning vara z-axeln, och ett plan d&auml;r vi k&auml;nner till E-f&auml;ltet &auml;r z=0. Transversella koordinater i detta plan &auml;r x och y. Det plan en str&auml;cka L senare (dvs z=L) d&auml;r vi ska ber&auml;kna f&auml;ltet har transversella koordinater X och Y. </P><P>Om vi betecknar f&auml;ltet i z=0 med</P></FONT><P><IMG SRC="Image410.gif" WIDTH=172 HEIGHT=25><FONT FACE="Arial">d&auml;r E<SUB>0</SUB> inneh&aring;ller E-f&auml;ltets amplitud, men ocks&aring; dess fas genom att</P></FONT><P><IMG SRC="Image411.gif" WIDTH=165 HEIGHT=25></P><FONT FACE="Arial"><P>Allm&auml;nnt kommer d&aring; f&auml;ltet i z=L att kunna skrivas som summan av alla f&auml;ltbidrag (inklusive fas) fr&aring;n alla sm&aring; ytsnuttar i z=0. </P></FONT><FONT FACE="Arial" COLOR="#ff0000"><P>N&auml;r fysiker s&auml;ger "summan av alla sm&aring; bidrag..." &auml;r detta i allm&auml;nnhet en f&ouml;rsk&ouml;nande omskrivning f&ouml;r en ganska vederv&auml;rdig integral. S&aring; &auml;ven i detta fall:</P></FONT><P><IMG SRC="Image412.gif" WIDTH=513 HEIGHT=48></P><FONT FACE="Arial"><P>Denna verkar inte s&aring; hemsk, men &auml;r faktiskt inte l&ouml;sbar om E<SUB>0 </SUB>har n&aring;got x och/eller y-beroende.</P><P>F&ouml;r att komma n&aring;gonstans (innan hela den eventuella l&auml;sekretsen somnat) v&auml;ljer vi att specialisera oss ordentligt. Vi tittar bara p&aring; en &ouml;ppning i en dimension (dvs skippar variationer i y-led, vi antar allts&aring; att &ouml;ppningen &auml;r utan begr&auml;nsning i y-led). Vi antar vidare att f&auml;ltet har konstant amplitud &ouml;ver hela &ouml;ppningen (betyder att &ouml;ppningen tr&auml;ffas av en parallell ljusstr&aring;le. Vi f&aring;r d&aring;</P></FONT><P><IMG SRC="Image414.gif" WIDTH=454 HEIGHT=58></P><FONT FACE="Arial"><P>Det sista ledet fick vi genom att anv&auml;nda seriutvecklingen:</P></FONT><P><IMG SRC="Image415.gif" WIDTH=189 HEIGHT=41></P><FONT FACE="Arial"><P>och att konstatera att X och x i de flesta praktiska fall &auml;r mycket mindre &auml;n L.</P><P>Vi f&aring;r nu att </P></FONT><P><IMG SRC="Image416.gif" WIDTH=366 HEIGHT=53></P><FONT FACE="Arial"><P>Det vi flyttat ut ur integralen &auml;r en fasfaktor med belopp 1 som f&ouml;rsvinner n&auml;r vi s&aring; sm&aring;ningom vill r&auml;kna ut intenstiteten (=observerbar varibel!!) genom att ta absolutbeloppkvadraten. Pga sv&aring;rartad skrivkramp skippar vi den d&auml;rf&ouml;r redan nu.</P><P>R&auml;knar vi med b&auml;gge de &aring;terst&aring;ende termerna i exponenten f&aring;r vi den typ av diffraktion som kallas fresneldiffraktion. Detta m&aring;ste man g&ouml;ra s&aring; l&auml;nge som den andra termen, n&aring;gonstans i &ouml;ppningen kommer n&auml;rheten av v&auml;rdet </FONT><FONT FACE="Symbol">p</FONT><FONT FACE="Arial">! </P></FONT><B><FONT FACE="Arial" COLOR="#ff0000"><P>&Ouml;vertyga dig g&auml;rna om att detta &auml;r detsamma som att &ouml;ppningen str&auml;cker sig utanf&ouml;r f&ouml;rsta fresnelzonen!!!</P></B></FONT><FONT FACE="Arial"><P>S&aring; l&auml;nge vi har fresneldiffraktion &auml;r man i n&auml;stan samtliga fall h&auml;nvisad till numeriska ber&auml;kningar, men i de fall den andra termen, i hela &ouml;ppningen &auml;r v&auml;sentligt mindre &auml;n </FONT><FONT FACE="Symbol">p</FONT><FONT FACE="Arial">, kan denna f&ouml;rsummas och &aring;terst&aring;r g&ouml;r d&aring; den integrand som definierar Fraunhoferdiffraktion. Vi ser att detta villkor &auml;r uppfyllt i o&auml;ndligheten eller i bilder av den (=foci).</P><P>Varf&ouml;r f&ouml;rsvinner inte den f&ouml;rsta termen i o&auml;ndligheten? </FONT><A HREF="fourkvar.html">!!!</A></P><FONT FACE="Arial"><P>Vi f&aring;r nu en integral som &auml;r t&auml;mligen l&auml;ttber&auml;knad. </P><P>Var nu glad och t&auml;nk p&aring; hur detta skulle varit att r&auml;kna i tv&aring; dimensioner i st&auml;llet!!</P></FONT></BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap2/sida2/matbesk1.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:53 GMT -->
</HTML>