<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap4/sida1/huvudsid1.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:15 GMT -->

<HEAD>
    <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
    <TITLE>huvudsid1</TITLE>
    <META NAME="Version" CONTENT="8.0.3410">
    <META NAME="Date" CONTENT="10/11/96">
    <META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\html.dot">
</HEAD>

<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff"><B>
        <FONT FACE="Arial" SIZE=5>
            <P>Kap 4 V&aring;goptik</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>Hittills har vi betraktat ljuset som str&aring;lar, utom i kapitlet om
    </FONT><A HREF="../../kap2/sida2/huvudsid2.html">
        <FONT FACE="Arial">diffraktion</FONT>
    </A>
    <FONT FACE="Arial">, d&auml;r vi talade om v&aring;gegenskapen diffraktion utan att ber&ouml;ra vad sorts
        v&aring;gor ljuset &auml;r. Detta ska vi nu f&ouml;rs&ouml;ka b&auml;ttra p&aring;. </P>
    </FONT><B>
        <FONT FACE="Arial" SIZE=5>
            <P>Ljuset som v&aring;g, transmission</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>Att ljuset &auml;r en v&aring;g &auml;r ett p&aring;st&aring;ende som brukar v&aring;lla m&aring;nga
            missf&ouml;rst&aring;nd. Till att b&ouml;rja med finns det ingenting i v&aring;gen som r&ouml;r sig i berg
            och dalbana. Det som h&auml;nder &auml;r att vi har en elektrisk dipol som ger ett elektriskt f&auml;lt som
            till v&auml;nster i fig. D&auml;r ligger dipolen still och
    </FONT>
    <FONT FACE="Arial" COLOR="#00ff00">f&auml;ltet</FONT>
    <FONT FACE="Arial"> &auml;r ned&aring;triktat vid observat&ouml;ren hela tiden.</P>
    </FONT>
    <P><IMG SRC="Image138.gif" WIDTH=551 HEIGHT=322></P>
    <FONT FACE="Arial">
        <P>Till h&ouml;ger har dipolen pl&ouml;tsligt bytt riktning. Den glade observat&ouml;ren borde d&aring;
            k&auml;nna ett upp&aring;triktat f&auml;lt i st&auml;llet. Problemet &auml;r att han inte kan k&auml;nna
            denna riktning&auml;ndring omedebart ty d&aring; skulle han kunna &ouml;verf&ouml;ra information fr&aring;n
            dipolen till sig sj&auml;lv med o&auml;ndlig hastighet, och det f&ouml;rbj&ouml;d Einstein (eller
            r&auml;ttare sagt, det &auml;r om&ouml;jligt enligt relativitetsteorin). Sj&auml;lva
    </FONT>
    <FONT FACE="Arial" COLOR="#ff0000">&auml;ndringen</FONT>
    <FONT FACE="Arial"> i f&auml;ltriktning, r&ouml;r sig med ljushastigheten mot observat&ouml;ren. Om vi nu
        t&auml;nker oss en dipol som sv&auml;nger riktigt snabbt fram och tillbaka, dvs en atom/molekyl som just
        h&aring;ller p&aring; att avge ljus (assymmetrier i elektronbanorna g&ouml;r att den beter sig som en
        oscillerande dipol just n&auml;r elektronen h&aring;ller p&aring; att ramla fr&aring;n en yttre niv&aring; till
        en inre). Det bli d&aring; n&aring;got i stil med nedanst&aring;ende fig:</P>
    </FONT>
    <P><IMG SRC="Image139.gif" WIDTH=549 HEIGHT=336></P>
    <FONT FACE="Arial">
        <P>Vi har allts&aring; v&auml;xlingar i f&auml;ltriktning som r&ouml;r sig fr&aring;n k&auml;llan med
            ljushastigheten. Tiden mellan tv&aring; s&aring;dana v&auml;xlingar &auml;r en <B>halv</B> period f&ouml;r
            den sv&auml;ngande dipolen. En hel period r&ouml;r sig tydligen en str&auml;cka av en v&aring;gl&auml;ngd,
    </FONT>
    <FONT FACE="Symbol">l</FONT>
    <FONT FACE="Arial">, p&aring; en period, T. Enlig den gamla mekanik-godingen "str&auml;cka=tid x hastighet" blir
        d&aring; </FONT>
    <FONT FACE="Symbol">l</FONT>
    <FONT FACE="Arial">=cT=c/f om f &auml;r frekvensen.</P>
        <P>Vad &auml;r det d&aring; som ser ut som en v&aring;g? Om man plottar E-f&auml;ltet som funktion av l&auml;ge
            blir det en sinusformig kurva, som r&ouml;r sig med ljushastigheten. Men man f&aring;r inte
            f&ouml;rv&auml;xla en plot med verkligheten. Det &auml;r allts&aring; ett elektriskt f&auml;lt som g&aring;r
            i v&aring;gor, ingenting materiellt r&ouml;r sig v&aring;gformigt.</P>
        <P><A NAME="brytnind">N&auml;r denna </A>v&aring;g passerar ett medium som glas eller vatten, kan man se det som
            h&auml;nder p&aring; tv&aring; s&auml;tt. B&auml;gge &auml;r liknelser, men beskriver verkligheten
            b&auml;ttre f&ouml;r den kvantmekaniske amat&ouml;ren &auml;n vad den verkliga begreppsapparaten skulle
            g&ouml;ra. Gl&ouml;m bara inte att det &auml;r en liknelse!</P>
        <P>Det f&ouml;rsta s&auml;ttet att se det &auml;r som fotoner som absorberas och emitteras s&aring;som vi
            beskrev det i
    </FONT><A HREF="../../kap3/sida1/huvudsid1.html">
        <FONT FACE="Arial">kap 3</FONT>
    </A>
    <FONT FACE="Arial">. Detta &auml;r ett bra s&auml;tt att beskriva emission och absorption, men mindre bra f&ouml;r
        att beskriva brytningsindex, och hur v&aring;gfronterna beter sig, s&aring; f&ouml;r att f&ouml;rst&aring; det
        tittar vi i st&auml;llet p&aring; dipolmodellen:</P>
        <P>En dipol ger inte bara ifr&aring;n sig ett elektriskt f&auml;lt, den p&aring;verkas ocks&aring; sj&auml;lv av
            ett yttre f&auml;lt. Om en dipol befinner sig i ett f&auml;lt (fr&aring;n en ljusstr&aring;le) kommer den
            att f&ouml;rs&ouml;ka st&auml;lla in sig i f&auml;ltets riktning. Om f&auml;ltet v&auml;xlar riktning med
            den frekvens som finns i exempelvis ljus, kommer den inte tilln&auml;rmelsevis att hinna med utan dipolen
            virerar bara svagt. Samtidigt p&aring;verkas emellertid ocks&aring; elektronskalen runt k&auml;rnan s&aring;
            att dessa f&ouml;rskjuts i f&ouml;rh&aring;llande till k&auml;rnan (som visserligen ocks&aring; &auml;r
            laddad men &auml;r mycket tyngre). Elektronmolnets sv&auml;ngande i f&ouml;rh&aring;llande till k&auml;rnan
            bildar d&aring; en oscillerande dipol som i sig s&auml;nder ut ljus (f&ouml;r det g&ouml;r ju dipoler
            n&auml;r de sv&auml;nger). Man kan visa att det p&aring; detta s&auml;tt uts&auml;nda ljus ligger efter
            ligger efter det ljus som orsakade dipolens sv&auml;ngning, i fas. (Om inte annat s&aring; f&ouml;r att
            verkan kommer efter orsak). Det f&auml;lt som forts&auml;tter efter passage av den atom som blivit en dipol
            &auml;r allts&aring; summan av det yttre och det nyuts&auml;nda, f&ouml;rsenade. Nettoresultatet &auml;r en
            f&ouml;rsening av v&aring;gen. Ju n&auml;rmre en resonansfrekvens f&ouml;r dipolen (motsvarar
            absorptionsfrekvens f&ouml;r fotonen) man kommer ju h&auml;ftigare blir dipolens sv&auml;ngning och ju
            st&ouml;rre blir f&ouml;rseningen. Detta medf&ouml;r att man f&aring;r en dispersionskurva som i t.ex i fig:
        </P>
    </FONT>
    <P><IMG SRC="Image140.gif" WIDTH=407 HEIGHT=232></P>
    <FONT FACE="Arial">
        <P>D&auml;r n &auml;r brytningsindex och
    </FONT>
    <FONT FACE="Symbol">k</FONT>
    <FONT FACE="Arial"> &auml;r absorbtionskoeffiecient (bulk). Vi ser att ni n&auml;rheten av
        absorptionsv&aring;gl&auml;ngder kommer n att g&aring; upp. Detta fenomen brukar kallas dispersion, och leder i
        allm&auml;nnhet till att brytningsindex stiger med sjunkande v&aring;gl&auml;ngd. Det &auml;r detta som ger
        upphov till </FONT><A HREF="../../kap2/sida1/huvudsid1.html#kromatiskabb">
        <FONT FACE="Arial">kromatisk aberration</FONT>
    </A>
    <FONT FACE="Arial"> i linssystem</P>
    </FONT>
    <FONT FACE="Symbol">
        <P>k
    </FONT>
    <FONT FACE="Arial"> anv&auml;nds f&ouml;r att ber&auml;kna hur snabbt ljuset avtar i intensitet enligt</P>
    </FONT>
    <P><IMG SRC="Image141.gif" WIDTH=78 HEIGHT=36></P>
    <FONT FACE="Arial">
        <P>Egentligen ska
    </FONT>
    <FONT FACE="Symbol">k</FONT>
    <FONT FACE="Arial"> anv&auml;ndas enbart f&ouml;r att beteckna att ljus absorberas i de atomer/molekyler det
        passerar. V&auml;rdet varierar d&aring; fr&aring;n 3-4 f&ouml;r metaller (d&auml;r ljuset allts&aring; bara kan
        tr&auml;nga in n&aring;gra hundra nm) &ouml;ver gr&aring;filter (som i solglas&ouml;gon tex) med
        10<SUP>-4</SUP>, sj&ouml;vatten (10<SUP>-6</SUP> skogstj&auml;rn, 10<SUP>-9</SUP> v&auml;stkusten) till luft
        10<SUP>-13</SUP>. Ofta bakar man emellertid in olika andra f&ouml;rlustmeknismer f&ouml;r ljuset som spridning
        mot partiklar, rayleighspridning och annat)</P>
        <P>Till
    </FONT><A HREF="../sida2/huvudsid2.html">
        <FONT FACE="Arial">n&auml;sta sida</FONT>
    </A>
    <FONT FACE="Arial"> (Interferens och optiska filter)</P>
        <P>Till
    </FONT><A HREF="../../kap5/sida1/huvudsid1.html">
        <FONT FACE="Arial">n&auml;sta kapitel</FONT>
    </A>
    <FONT FACE="Arial"> (Modern optronik)</P>
        <P>Till
    </FONT><A HREF="../../inledning/index.html">
        <FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT>
    </A></P>
</BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap4/sida1/huvudsid1.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:16 GMT -->

</HTML>