<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap5/sida4/huvudsid4.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:33 GMT -->
<HEAD><META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252"><TITLE>huvudsid4</TITLE><META NAME="Version" CONTENT="8.0.3410"><META NAME="Date" CONTENT="10/11/96"><META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\HTML.DOT"></HEAD><BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff"><B><FONT FACE="Arial" SIZE=5><P>Faskonjugering</P><IMG SRC="Image367.gif" ALIGN="LEFT" HSPACE=12 WIDTH=215 HEIGHT=144> </B></FONT><FONT FACE="Arial"><P>Ett mycket m&auml;rkligt fenomen intr&auml;ffar n&auml;r tre f&auml;lt med samma v&aring;gl&auml;ngd &ouml;verlappar i ett material med stora ickelinj&auml;ra koefficienter av tredje ordningen. L&aring;t tv&aring; av dem vara antiparallella och den tredje av godtycklig riktning, kallad prob eller ibland signal. Om tv&aring; fotoner fr&aring;n de antiparallela str&aring;larna ankommer samtidigt till en molekyl i materialet, s&aring; lagras under </FONT><A HREF="../kap4/sida1/huvudsid1.html#brytnind"><FONT FACE="Arial">handskakningstiden</FONT></A><FONT FACE="Arial"> energi motsvarande tv&aring; fotoner och r&ouml;relsem&auml;ngden noll. Det sistn&auml;mnda eftersom r&ouml;relsem&auml;ngd &auml;r en vektor. N&auml;r molekylen efter n&aring;gon femtosekund desperat letar efter m&ouml;jligheter att g&ouml;ra sig av med energin finns tre m&ouml;jligheter:</P><DIR></FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT FACE="Arial" COLOR="#008000">&nbsp;Att l&auml;gga ut de nya fotonerna parallellt med de ursprunliga str&aring;larna. Om detta intr&auml;ffar &auml;r det enda som syns utifr&aring;n att en liten f&ouml;rsening intr&auml;ffat. Vi har f&aring;tt ett ickelinj&auml;rt bidrag till brytningsindex. </P></B></FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT FACE="Arial" COLOR="#008000">&nbsp;Att skicka ut energin med den f&ouml;rsta fotonen i en helt slumpm&auml;ssig riktning, och "d&auml;refter" den andra i motsatt riktning. Detta &auml;r en form av ickelinj&auml;r spridning som inte har s&auml;rdeles stor sannolikhet.</P></B></FONT><P><IMG SRC="Bullet7.gif" WIDTH=15 HEIGHT=12><B><FONT FACE="Arial" COLOR="#008000">&nbsp;Den tredje varianten &auml;r att h&auml;lften av energin l&auml;ggs som en foton som f&ouml;rst&auml;rker den urspungliga tredje str&aring;len. Resterande energi motsvarande en foton kommer d&aring; att s&auml;ndas ut i en ny (fj&auml;rde) str&aring;le som kommer att vara helt antiparallell med proben.</P></DIR></B></FONT><FONT FACE="Arial"><P>Vi har allts&aring; skapat en idealisk retroreflektor f&ouml;r proben. Denna har dessutom en m&auml;rklig egenskap: Eftersom energin hela tiden kommer fr&aring;n de ursprungliga antiparallella str&aring;larna, kan man styra "refektansen" till godtyckligt v&auml;rde genom att &ouml;ka dessas intensitet och/eller &ouml;verlappsstr&auml;cka med proben. Reflektanser p&aring; 100.000 har uppm&auml;tts, vilket f&ouml;rmodligen f&aring;r anses n&aring;got b&auml;ttre &auml;n badrumsspegeln d&auml;rhemma. Dessutom reflekteras ljuset allts&aring; tillbaka till k&auml;llan vilket aluminiumspeglar inte heller g&ouml;r.</P><P>Mest njutningsfull blir uppenbarligen denna framst&auml;llning om man f&ouml;rdjupar sig i matten. Men f&ouml;r det kr&auml;vs en del </FONT><A HREF="matematiskt.html"><FONT FACE="Arial">entusiasm</FONT></A><FONT FACE="Arial">.</P><P>F&ouml;r oss andra kan det vara nog att diskutera lite till&auml;mpningar:</P><P>Det faktum att ljuset g&aring;r tillbaka mot sin k&auml;lla och i vissa fall med en reflektans mycket st&ouml;rre &auml;n 1 kan anv&auml;ndas p&aring; en m&auml;ngd s&auml;tt.</P><P>Till att b&ouml;rja med kan den anv&auml;ndas f&ouml;r aberrationsfri avbildning 1:1, i f&ouml;rsta hand f&ouml;r transmitterande objekt (diabilder) eller spekul&auml;ra ytor (t.ex litografisubstrat)</P><P>Uppst&auml;llningen ser i s&aring; fall ut som i fig:</P><IMG SRC="Image378.gif" ALIGN="LEFT" HSPACE=12 WIDTH=412 HEIGHT=269> <P>Ljuset transmitteras genom objektet ochg fram till str&aring;ldelaren. D&auml;r delas h&auml;lften av och f&ouml;rsvinner upp&aring;t (detta ljus &auml;r bort ut leken och kommer inte att &aring;tervinnas. Det ljus som g&aring;tt igenom str&aring;ldelaren samlas av linsen mot den faskonjugerande spegeln (ej n&ouml;dv&auml;ndigt om spegeln &auml;r stor) . D&auml;r ger det upphov till den konjugerade str&aring;len som exakt v&auml;nder tillbaka genom uppst&auml;llningen. De </FONT><A HREF="../../kap2/sida1/huvudsid1.html#sfabb"><FONT FACE="Arial">aberrationer</FONT></A><FONT FACE="Arial"> som linsen gav upphov till upph&auml;vs och den del av ljusf&auml;ltet som transmitteras genom str&aring;ldelaren kommer att &aring;terv&auml;nda exakt till de delar av objektet d&auml;r detta hade h&ouml;g transmission. Det g&ouml;r emellertid att den h&auml;lft som speglas ned&aring;t av str&aring;ldelaren kommer att formera sig exakt till den ljusf&ouml;rdelning som fanns i objektet. </P><P>En annan till&auml;mpning &auml;r milit&auml;r eller har med fusionskraft att g&ouml;ra (v&auml;lj sj&auml;lv). En laser f&aring;r belysa det f&auml;lt d&auml;r m&aring;let dyker upp (fientlig satellit eller v&auml;tekorn som ska ant&auml;ndas i fusionsreaktor). Reflexer fr&aring;n denna sprids &aring;t alla h&aring;ll och n&aring;gon liten del tr&auml;ffar den/de faskonjugerade speglar som &auml;r uppst&auml;llda bredvid belysningslasern. Om denna &auml;r pumpad s&aring; att dess relektans blir mycket h&ouml;g kommer d&aring; en str&aring;le att v&auml;xa upp mellan m&aring;l och faskonjugator. …och d&auml;rmed har man f&aring;tt som man ville…</P><P>Till </FONT><A HREF="../../inledning/index.html"><FONT FACE="Arial">inneh&aring;llsf&ouml;rteckning</FONT></A></P></BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap5/sida4/huvudsid4.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:34 GMT -->
</HTML>