<HTML>
<HEAD>
    <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
    <TITLE>Kap 1 Geometrisk optik</TITLE>
    <META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\html.dot">
</HEAD>
<BODY LINK="#0000ff" VLINK="#800080">
    <FONT FACE="Arial">
        <P>&nbsp;</P>
    </FONT><B>
        <FONT FACE="Arial" SIZE=6>
            <P ALIGN="CENTER">Kap 1 Geometrisk optik</P>
        </FONT>
        <FONT FACE="Arial" SIZE=5>
            <P ALIGN="CENTER">Hur uppkommer en bild?</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>I all optik pratar vi om objekt och bilder, allts&aring; b&ouml;rjar vi med att g&ouml;ra klart f&ouml;r oss
            vad vi menar d&aring;.</P>
    </FONT><B>
        <FONT FACE="Arial" SIZE=4>
            <P ALIGN="JUSTIFY">Definition:</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>Objekt &auml;r en samling punkter varifr&aring;n ljus sprids i ett vinkelomr&aring;de.</P>
        <P>Kommentar:</P>
        <P>Detta inneb&auml;r att ett objekt antingen kan vara en ljusk&auml;lla (lampa, stearinljus e.d.) eller ett
            f&ouml;rem&aring;l som sprider inkommande belysning. Det sistn&auml;mnda &auml;r vanligast. En t&aring;, en
            katt och en stridsvagn &auml;r bra exempel p&aring; objekt, men en spegel &auml;r det inte.
    </FONT><A HREF="ejspegel.html">
        <FONT FACE="Arial">Varf&ouml;r?</FONT>
    </A></P>
    <FONT FACE="Arial">
        <P>&nbsp;</P>
    </FONT><B>
        <FONT FACE="Arial" SIZE=4>
            <P ALIGN="JUSTIFY">Definition:</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>Bild &auml;r en punkt d&auml;r str&aring;lar fr&aring;n objektet g&aring;r ihop (reell bild) eller ser ut att
            ha g&aring;tt ihop (virtuell bild)</P>
        <P>Kommentar:</P><IMG SRC="Image29.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=316 HEIGHT=256>
        <P ALIGN="JUSTIFY">Detta blir klarast av ett litet exempel. T&auml;nk Dig en t&aring; 1m under en lugn
            vattenyta. Str&aring;larna (som fr&aring;n b&ouml;rjan kommer fr&aring;n solen, vilket vi struntar i nu)
            fr&aring;n t&aring;n sprids d&aring; &aring;t alla h&aring;ll. I figuren h&auml;rintill har vi ritat ut
            tv&aring; av dessa. De
    </FONT><A HREF="brytningslagen.html">
        <FONT FACE="Arial">bryts (niv&aring;2)</FONT>
    </A>
    <FONT FACE="Arial"> n&auml;r de kommer till vattenytan. En betraktare ovan vattenytan ( den lilla dottern som kommer
        och ser att pappa ser kortare ut &auml;n vanligt n&auml;r han st&aring;r i vattnet) ser de tv&aring;
        str&aring;larna som ser ut att komma fr&aring;n en punkt d&auml;r de streckade linjerna b&ouml;rjar.
        Betraktarens hj&auml;rna/synsinne inneh&aring;ller ingen liten bildprocessor som k&auml;nner till
        brytningslagen, och d&auml;rf&ouml;r tolkar vi synintrycket som att det vi tittar p&aring; ligger i
        utg&aring;ngspunkten f&ouml;r de streckade str&aring;larna. </P>
        <P>Riktningen till bilden avg&ouml;rs allts&aring; av &aring;t vilket h&aring;ll vi tittar, medan hj&auml;rnan
            best&auml;mmer avst&aring;ndet till bilden genom att k&auml;nna av vinkelst&auml;llningen mellan &ouml;gonen
            (dvs hur mycket man skelar, n&auml;r man tittar p&aring; ett objekt). Denna information anv&auml;nder sedan
            hj&auml;rnan till att best&auml;mma vilken sk&auml;rpeinst&auml;llning (ackomodation) &ouml;gat beh&ouml;ver
            ha. D&auml;rut&ouml;ver har m&auml;nniskkroppen reservf&ouml;rfaranden f&ouml;r
            avst&aring;ndsinst&auml;llning om man skulle r&aring;ka bli en&ouml;gd, men det bortser vi fr&aring;n nu.
        </P>
        <P>Det vi ser under vattenytan &auml;r nu en virtuell bild av t&aring;n. Str&aring;larna har aldrig varit i den
            punkt de ser ut att komma ifr&aring;n.</P>
        <P>Den andra bildtypen &auml;r en reell bild, d&auml;r str&aring;larna verkligen g&aring;r ihop i en punkt.
            Exempel p&aring; detta &auml;r projektorer av olika slag, d&auml;r str&aring;larna g&aring;r ihop p&aring;
            sk&auml;rmen och kameror d&auml;r de g&aring;r ihop (ska g&aring; ihop) p&aring; filmen. S&aring;dana bilder
            uppkommer bara n&auml;r kr&ouml;kta ytor &auml;r inblandade (men det m&aring;ste inte bli en reell bild om
            man har en kr&ouml;kt yta).</P>
        <P>Vi beh&ouml;ver tv&aring; definitioner till f&ouml;r att vara n&ouml;jda:</P>
        <P><A NAME="objektsrymden">Objektsrymd </A>(OR) &auml;r den sida om en brytande yta (plan eller kr&ouml;kt)
            varifr&aring;n ljuset kommer. </P>
    </FONT>
    <P><A HREF="Vattensidan.html">
            <FONT FACE="Arial">Vilken sida var objektrymd i t&aring;-under-vatten-exemplet ovan?</FONT>
        </A></P>
    <FONT FACE="Arial">
        <P><A NAME="bildrymden">Bildrymden</A> (BR) &auml;r den sida om ytan vart&aring;t ljuset &auml;r p&aring;
            v&auml;g.</P>
        <P>OBS allts&aring; att det inte &auml;r s&aring; enkelt att bilden ligger i bildrymden och objektet i
            objektsrymden!! T&aring;n och bilden av t&aring;n ligger ju b&aring;da under vatten. Konstigt s&aring;ge det
            nog ut annars!!</P>
        <P>Till
    </FONT><A HREF="../sida2/Huvudsid2.html">
        <FONT FACE="Arial">n&auml;sta sida</FONT>
    </A>
    <FONT FACE="Arial"> (Avbildning i sf&auml;risk yta)</P>
        <P>Till
    </FONT><A HREF="../../kap2/sida1/Huvudsid1-2.html">
        <FONT FACE="Arial">n&auml;sta kapitel</FONT>
    </A>
    <FONT FACE="Arial"> (Begr&auml;nsningar i optiska system)</P>
        <P>Till
    </FONT><A HREF="../../inledning/index.html">
        <FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT>
    </A></P>
</BODY>
</HTML>