<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap4/sida3/huvudsid3.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:22 GMT -->
<HEAD><META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252"><TITLE>huvudsid3</TITLE><META NAME="Version" CONTENT="8.0.3410"><META NAME="Date" CONTENT="10/11/96"><META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\HTML.DOT"></HEAD><BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff"><B><FONT FACE="Arial" SIZE=5><P>Polarisation</P></B></FONT><FONT FACE="Arial"><P>Det finns ytterligare en klass av fenomen som vi inte tittat p&aring; r&ouml;rande ljus, och det &auml;r de som har med ljusets E-f&auml;lts riktning att g&ouml;ra. I </FONT><A HREF="../sida1/huvudsid1.html">v&aring;r bild</A><FONT FACE="Arial"> av ljuset som det elektriska f&auml;ltet fr&aring;n en osciellerande dipol framgick att f&auml;ltet var vinkelr&auml;tt mot utbredningsriktningen. Men n&auml;r vi v&auml;l vet det finns det ju tv&aring; riktningar kvar n&auml;r vi har best&auml;mt utbredningsrktningen. Valet av E-f&auml;ltsriktning kallas ljusets polarisation.</P><P>Den enklaste formen av polariserat ljus &auml;r den linj&auml;rpolariserade eller planpolariserade (orden betyder samma sak). E-f&auml;ltet ligger d&auml;r hela tiden i samma plan. Laddar man ner v&aring;r lilla </FONT><A HREF="VAAG3d.html">matlabsnutt</A><FONT FACE="Arial"> och s&auml;tter fasskillnaden till noll ser man att detta blir fallet om vi har en </FONT><FONT FACE="Arial" COLOR="#000080">x-komp</FONT><FONT FACE="Arial"> och en </FONT><FONT FACE="Arial" COLOR="#ff0000">y-komp</FONT><FONT FACE="Arial"> som ligger i fas eller </FONT><FONT FACE="Symbol">p</FONT><FONT FACE="Arial"> ur fas. Resultaten kommer d&aring; att bilda vinkeln 45° mot xz-planet. K&ouml;r programmet och byt till </FONT><FONT FACE="Symbol">p</FONT><FONT FACE="Arial"> (skriv pi) i fasskillnad. Vad blir skillnaden? (</FONT><A HREF="plusmin.html">!!</A><FONT FACE="Arial">)</P><P>En fasskillnad p&aring; 180° mellan x- och y-komp ger allts&aring; en polarisationriktningsvridning p&aring; 90°</P></FONT><FONT FACE="Old Style Bold Outline" COLOR="#ff0000"><P>Opedagogiskt men sant</FONT><FONT FACE="Arial" COLOR="#ff0000">!!</P></FONT><FONT FACE="Arial"><P>F&ouml;r att f&ouml;rst&aring; var i naturen vi hittar linj&auml;rpolariserat m&aring;ste vi f&ouml;rst titta p&aring; naturligt ljus (eller opolariserat, som man ibland s&auml;ger). varje ljustuts&auml;ndade atom ger d&auml;r linj&auml;rpolariserat ljus, men eftersom de &auml;r helt okorrelerade kommer polarisationsriktningen att &auml;ndras varje g&aring;ng en atom kroknar och en annar tar vid (p&aring; samma s&auml;tt som vi </FONT><A HREF="../sida2/huvudsid2.html#begfas">konstaterade</A><FONT FACE="Arial"> att begynnelsefasen &auml;ndras s&aring; ofta, vilket hade betydelse f&ouml;r interferens med ljus). S&aring;dant ljus uppvisar inga polarisationsegenskaper eftersom variationerna i riktning blir s&aring; snabba att man inte kan detektera dem (och &auml;nnu mindre se resultatet av dem med &ouml;gonen). </P><IMG SRC="Image146.gif" ALIGN="RIGHT" HSPACE=12 WIDTH=416 HEIGHT=264> <P>L&aring;ter man s&aring;dant ljus passera ett polarationsfilter (polaroid) kommer ljuset att bli linj&auml;rpolariserat, s&aring; l&aring;t oss se hur ett s&aring;dant fungerar: I ett genomskinligt plastmaterial bakar man in l&aring;nga molekyltr&aring;dar, med samma riktning. Dessa har elektroner som &auml;r r&ouml;rliga utmed tr&aring;darna (men inte vinkelr&auml;t mot dem) vilket inneb&auml;r att om inkommande ljus &auml;r parallellt med tr&aring;darna kommer det att s&auml;tta dessa elektroner i r&ouml;relse vilket g&ouml;r att ljuset absorberas. Bildar det en vinkel med tr&aring;darna kommer den komponent som ligger vinkelr&auml;t mot tr&aring;driktningen att transmitteras. (som bildar vinkeln </FONT><FONT FACE="Symbol">a</FONT><FONT FACE="Arial"> med E<SUB>in i</SUB> fig). Det ljus som transmitteras har allts&aring; E-f&auml;ltet, och d&auml;rmed instensiteten:</P></FONT><P><IMG SRC="Image147.gif" WIDTH=241 HEIGHT=25><FONT FACE="Arial">Malus lag</P><P>det ljus som kommer i genom filtret har allts&aring; f&ouml;rlorat i intensitet enligt ovan och &auml;r linj&auml;rpolariserat i genomsl&auml;ppsriktningen. Om det inkommande ljuset &auml;r linj&auml;rpolariserat b&auml;t den transmitterade intesiteten h&auml;lften av den inkommande (medelv&auml;rdet av cos²</FONT><FONT FACE="Symbol">a </FONT><FONT FACE="Arial">f&ouml;r alla vinklar=1/2)</P></FONT><P><A HREF="cp_ep.html">Sedan finns det andra polarisationstillst&aring;nd som uppkommer vid andra fasskillnader</A><FONT FACE="Arial">.</P><P>En viktig till&auml;mpning av polarisation &auml;r elektrooptiska modulatorer, d&auml;r man mellan tv&aring; korsade polaroider placerar en dubbelbrytande kristall som &auml;ndrar fasf&ouml;rh&aring;llandet mellan komponenterna om det ligger ett yttre elektriskt f&auml;lt &ouml;ver den men inte annars. Genom att &auml;ndra sp&auml;nningen &ouml;ver kristaller kan man allts&aring; best&auml;mma hur mycket ljus som ska transmitteras genom den andra polaroiden. </P><IMG SRC="Image148.gif" ALIGN="LEFT" HSPACE=12 WIDTH=429 HEIGHT=282> <P>Vid ljusets reflektion uppkommer ocks&aring; polarisationfenomen. </P><P>F&ouml;r att studera dem m&aring;ste vi definiera begreppet infallsplan som det plan som inneh&aring;ller infallande str&aring;le och ytans normal. Vi brukar d&aring; kalla det ljus </FONT><FONT FACE="Arial" COLOR="#000080">som har E-f&auml;ltet i infallsplanet</FONT><FONT FACE="Arial"> f&ouml;r TM, p, </FONT><FONT FACE="Symbol">p </FONT><FONT FACE="Arial">eller </FONT><FONT FACE="Symbol">¤¤, </FONT><FONT FACE="Arial" COLOR="#ff0000">medan det som ligger vinkelr&auml;tt</FONT><FONT FACE="Arial"> mot infallsplanet kallas TE, s, </FONT><FONT FACE="Symbol">s</FONT><FONT FACE="Arial"> eller </FONT><FONT FACE="Symbol">^. </FONT><FONT FACE="Arial">Beteckningarna varierar mellan olika b&ouml;cker, d&auml;rav plottret.</P><P><A NAME="fresnel">Reflektansen</A> f&ouml;r det inkommande ljuset blir nu f&ouml;r de b&auml;gge infallsriktningarna</P></FONT><P><IMG SRC="Image149.gif" WIDTH=278 HEIGHT=49></P><FONT FACE="Arial"><P>Anv&auml;nd nu v&aring;r lilla snutt </FONT><A HREF="fresnel.html">fresnel.m</A><FONT FACE="Arial"> f&ouml;r att se hur reflektansen (och dess E-f&auml;ltsmotsvarighet) &auml;ndras med olika kombinationer av vinklar och index.</P><P>Vi drar h&auml;r nedan n&aring;gra slutsatser. Verifiera dem genom att k&ouml;ra programmet fler g&aring;nger med olika index.</P><P>F&ouml;r riktigt flacka vinklar stiger reflektansen mot 1 f&ouml;r b&auml;gge polarisationsriktningarna.</P><P>Ju mindre skillnad i brytningsindex ju mindre reflektans.</P><P>F&ouml;r sm&aring; infallsvinklar blir reflektansen <IMG SRC="Image150.gif" WIDTH=97 HEIGHT=49>, vilket f&ouml;r en glas/luftyta ger ca 0.04, dvs 4%</P><P>F&ouml;r vinklar s&aring;dana att i+b=90° blir R<SUB>p</SUB>=0 vilket inneb&auml;r att allt ljus som reflekteras i denna vinkel blir s-pol. Eftersom minimet &auml;r ganska flackt, blir reflektansen &auml;ven f&ouml;r kringliggande vinklar n&auml;ra noll f&ouml;r p-pol. Det &auml;r i dessa fall som polaroidsolglas&ouml;gon sl&auml;cker ut reflexer? </P><P>Hur ska genomsl&auml;ppsriktningen vara orienterad p&aring; dem om de ska sl&auml;cka ut reflexer fr&aring;n havsytan? (</FONT><A HREF="vattrefl.html">!!</A><FONT FACE="Arial">)</P><P>Hur kan vi ta reda p&aring; vilket i som g&ouml;r att i+b=90°?</P><P>Med en stunds arbete kommer fram till att i=arctan(n<SUB>2</SUB>/n<SUB>1</SUB>)</P><P>Till n&auml;sta </FONT><A HREF="../sida4/huvudsid4.html"><FONT FACE="Arial">sida</FONT></A><FONT FACE="Arial"> (gitter)</P><P>Till n&auml;sta </FONT><A HREF="../../kap5/sida1/huvudsid1.html"><FONT FACE="Arial">kapitel</FONT></A><FONT FACE="Arial"> (Fiberoptik)</P><P>Till </FONT><A HREF="../../inledning/index.html"><FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT></A></P></BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap4/sida3/huvudsid3.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:24 GMT -->
</HTML>