<HTML>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap1/sida6/huvudsid6.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:47 GMT -->

<HEAD>
    <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=windows-1252">
    <TITLE>Mikroskopet</TITLE>
    <META NAME="Version" CONTENT="8.0.3410">
    <META NAME="Date" CONTENT="10/11/96">
    <META NAME="Template" CONTENT="D:\Program\Microsoft Office\Office\HTML.DOT">
</HEAD>

<BODY LINK="#0000ff" VLINK="#800080" BGCOLOR="#ffffff"><B>
        <FONT FACE="Arial" SIZE=5>
            <P>Mikroskopet</P>
    </B></FONT>
    <FONT FACE="Arial">
        <P>Mikroskopets uppgift &auml;r naturligtvis ocks&aring; att &ouml;ka den synvinkel ett givet objekt upptar.
            Skillnaden gentemot telskopet &auml;r givetvis att objektet kanplaceras p&aring; det avst&aring;nd man vill
            och att objektet i sig &auml;r mycket litet. Vidare &auml;r objektet i allm&auml;nnhet inte
            sj&auml;lvlysande, varav f&ouml;ljer att man beh&ouml;ver ett belysningssystem.</P>
        <P>Vi b&ouml;rjar emellertid med det avbildande systemet, som best&aring;r av </P>
        <P>Ett objektiv som vi kommer att hantera som om det vore en tunn lins. Detta &auml;r naturligtvis l&aring;ngt
            fr&aring;n sanningen eftersom de normalt &auml;r ca 20-30mm l&aring;nga och har fokall&auml;ngder p&aring;
            n&aring;gra mm. F&ouml;r att f&ouml;rst&aring; varf&ouml;r man beh&ouml;ver s&aring; m&aring;nga linser i
            objeketivet beh&ouml;ver man k&auml;nna till aberrationer vilka behandlas i
    </FONT><A HREF="../../kap2/sida1/huvudsid1.html">
        <FONT FACE="Arial">kap 2</FONT>
    </A>
    <FONT FACE="Arial">.</P>
        <P>Ett okular som alltid &auml;r flerlinsigt. Vi kommer att anv&auml;nda oss av Huygens okular fr&aring;n
            f&ouml;rra avsnittet.</P>
        <P>Den b&auml;rande id&eacute;n &auml;r att anv&auml;nda objektivet f&ouml;r att ge en reell mellanbild,
            f&ouml;rstorad n&aring;gra tiotal ggr som d&auml;refter anv&auml;nds som objekt till okularet . Mellanbilden
            placeras i okularets fr&auml;mre fokalplan vilket ger en slutbild i o&auml;ndligheten. Okularet anv&auml;nds
            allts&aring; som lupp.</P>
    </FONT>
    <P><IMG SRC="mikravb.jpg" WIDTH=627 HEIGHT=264></P>
    <FONT FACE="Arial">
        <P>Objektet placeras s&aring; att det ger en mellanbild i okularets fr&auml;mre fokalplan dvs i dess f&ouml;rsta
            lins. Avst&aring;ndet fr&aring;n objektivet till denna, d, kallas mikroskopets tubl&auml;ngd och brukar vara
            runt 200mm. F&ouml;rstoringen i objektivet blir allts&aring; H/h=d/f1.</P>
        <P>Denna mellanbild observeras nu igenom okularet dvs den vinkel slutbilden upptar &auml;r H/f2, vilket ska
            j&auml;mf&ouml;ras med den vinkel samma objekt, p&aring; samma st&auml;lle skulle upptagit om linserna inte
            suttit d&auml;r. Denna &auml;r</P>
        <P><IMG SRC="Image568.gif" WIDTH=112 HEIGHT=44></P>
        <P>Vinkelf&ouml;rstoringen blir allts&aring; </P>
        <P><IMG SRC="Image569.gif" WIDTH=361 HEIGHT=46></P>
        <P>Belysningsstr&aring;lg&aring;ngen ska sedan utformas s&aring; att ljuset leds in i mikroskopet p&aring; ett
            effektivt s&auml;tt, och sedan, med s&aring; sm&aring; f&ouml;rluster som m&ouml;jligt leds till
            uttr&auml;despupillen d&auml;r observat&ouml;ren placerar sitt &ouml;ga.</P>
    </FONT>
    <P><IMG SRC="mikroskbel.jpg" WIDTH=621 HEIGHT=199></P>
    <FONT FACE="Arial">
        <P>Kondensorlins och lampa v&auml;ls s&aring; att lampan avbildas p&aring; objektivet. Bilden ska vara
            ungef&auml;r j&auml;mnstor med dettas intr&auml;despupill. Eftersom uttr&auml;despupillen &auml;r en bild av
            intr&auml;despupillen kommer d&auml;rvid alla str&aring;lar som passerar in i objektivet att passera ut
            genom uttr&auml;despupillen.</P>
        <P>Till
    </FONT><A HREF="../../kap2/sida1/Huvudsid1-2.html">
        <FONT FACE="Arial">n&auml;sta kapitel</FONT>
    </A>
    <FONT FACE="Arial"> (Begr&auml;nsningar i optiska system)</P>
        <P>Till
    </FONT><A HREF="../../inledning/index.html">
        <FONT FACE="Arial">inneh&aring;llsf&ouml;rteckningen</FONT>
    </A></P>
    <FONT FACE="Arial"></FONT>
</BODY>
<!-- Mirrored from static.sys.kth.se/sci/gm/bok/kap1/sida6/huvudsid6.htm by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 25 Feb 2021 08:42:48 GMT -->

</HTML>